//wiz_apply

inherit ROOM;
#include <ansi.h>

void create()
{
        set("short","ÐÂÎ×Ê¦ÉêÇë´¦");
        set("long", @LONG
        Ê×ÏÈ£¬Äã±ØÐë¿¼ÂÇÇå³þ£¬³ÉÎªÒ»ÃûÎ×Ê¦´ú±íÄã½«Ô¸Òâ»¨¿ÉÄÜÕ¼È¥Äã´ó
²¿·ÖµÄÐÝÏÐÊ±¼äÔÚÄà°ÍÉÏ£¬Èç¹ûÄã²»Ô¸Òâ£¬×îºÃ»¹ÊÇµ±¸öÍæ¼ÒµÄºÃ£¬ÎÒÃÇ
Ä¿Ç°ÐèÒªµÄÊÇÓÅÐãµÄÎ×Ê¦£¬¹²Í¬¿ª·¢ºÃÕâ¸ömudÎÒÃÇµÄÐèÒª
        1. Äã±ØÐëÊÇ¸ö¡¸ÀÏÁ·¡¹µÄÍæ¼Ò.
        2. Äã±ØÐëÑ§¹ý C ÓïÑÔ »ò LPC ÓïÑÔ¡£
        3. ¶ÔÉñ»°Ð¡ËµÓÐÒ»¶¨µÄÈÏÊ¶¡£
        4. Äã±ØÐëÓÐºÍËûÈËºÏ×÷£¬²¢ÇÒÈÝÈÌÅúÆÀºÍ±ðÈËÐÞ¸ÄÄãµÄ×÷Æ·µÄÑÅÁ¿¡£

   ÎÒÃÇ²¢²»´òËã¸øÐÂÎ×Ê¦ÈÎºÎÑ¹Á¦¡£ÔÚÄãÏÂ¶¨¾öÐÄÒª³ÉÎªÒ»ÃûÎ×Ê¦Ö®áá£¬
²¢ÇÒÈÏÎª×Ô¼ºÄÜ¹»Âú×ãÌõ¼þºó,

                ÇëÊäÈëÄúµÄ¡¼ÕæÊµÐÕÃû¡½£º
                ÇëÊäÈëÄúµÄ¡¼Î×Ê¦ÐÕÃû¡½£º
                ÇëÊäÈëÄúÎ×Ê¦µÄ¡¼Ó¢ÎÄÐÕÃû¡½£º
                ÇëÊäÈëÄúµÄ¡¼ÐÔ±ð¡½£º
                ÇëÊäÈëÄúµÄ¡¼ÄêÁä¡½£º
                ÇëÊäÈëÄúµÄ¡¼e-mailµØÖ·¡½£º

                ÄãµÄÁªÏµµØÖ·ºÍµç»°£¬´«ºô£º
                ÄãµÄµ¥Î»£¨Ñ§Ð££©£º
                ÄãÊÇ·ñÓÐ×ã¹»µÄÊ±¼äÀ´²ÎÓë±¾MUDµÄ½¨Éè£º
                ÊÇ·ñÊìÏ¤mud£º
                ÄãÊìÏ¤ÄÇ¼¸ÖÖ³ÌÐòÓïÑÔ£¨Èç£ºC,C++,JAVA,LPC £©

            [0;5;1;37m            Çë´ó¼ÒÓÃreturnÕâ¸öÃüÁîÀë¿ªÕâÀï!
     [0;0m
LONG);
        set("exits",([]));
        set("no_fight", 1);
        set("no_magic", 1);
        set("no_clean_up", 0);
        setup();
        call_other("/obj/board/wizapply_b", "???");
}

void init()
{
        add_action("do_return", "return");
}

int do_return(string arg)
{
        object me = this_player();

        message_vision(HIC"Ö»¼ûÑÛÇ°Ò»Õó"HIR"¿ñ·ç\n"NOR,me);
        message_vision(HIR"¿Õ¼äÒ»Õó×ª±ä£¬$N±»´«ËÍ»ØÀ´µÄµØ·½¡£\n"NOR,me);

        if (me->query("old_place"))     me->move(me->query("old_place"));
        else me->move("/d/city/kezhan");
        message_vision(HIR"¿Õ¼äÒ»Õó×ª±ä£¬$N±»´«ËÍµ½ÁËÁíÒ»¸öµØ·½¡£\n"NOR,me);
        me->delete("old_place");
        return 1;
}
