//By tianlin@mhxy for 2002.1.9
//by tianlin 2001.5.1
//уБп╘╢ййг╢сdhxyиоу╙Ё╜╣д.

#include <ansi.h>

string give_gift();

private mixed *story = ({
        "еёд╖мУЁигв",
        "",
        "еёд╖мУё╨воо╪ё╛й╣╡╩оЮбВё╛╬╜╧ЩуБа╫лЛЁ╞о╕оЮ╢╕ё╛нр╥╒╬Унрря╬╜иНиН╣ь╟╝иоакдЦ",
        "еёд╖мУё╨н╙ак╠Мй╬╤тдЦ╣дЁорБё╛уБ╦Жтб╧Б╠╕╨пйгнркм╦ЬдЦ╣д╤╗гИпенОё╛оёмШдЦдэ╪ч╦Ьнрё║",
        "╦РС║╬╚ё╨нр╥╢╤туБцегвйбё║",
        "еёд╖мУё╨╟║ё©дЦк╣й╡ц╢ё©",
        "жавП╠╕ё╨нрю╢ё║к╣й╡ц╢к╣й╡ц╢к╣й╡ц╢ё©хк╪рюи╡ее╝ц╡лЛиЗр╩╤тё╛бж╣╫дЦуБ╦ЖяЩ╧жю╢╥╢╤тё©",
        "╦РС║╬╚ё╨воо╪оивстЯе╪йгспр╩╦Ж╧Ф╬ь╣дё╛хГ╧Ш╢С╦ГдЦдэвЖ╣ц╣╫╣д╩╟ё╛нрцг╬мпд╥Ч©з╥Чё║",
        "жавП╠╕ё╨спй╡ц╢╧Ф╬ь╟║ё©",
        "╦РС║╬╚ё╨кЩтЬ╬╜╥╒╧Щйд╟║ё╛хГ╧Шк╜дэ╟явогЮ╠╕╫ё╟нЁЖгй╣д╩╟дьё╛╬мйгкЩ╣дхГрБюи╬Щё║",
        "жавП╠╕ё╨╟║ё©ц╩оК╣╫╬╧йгвт╪╨╟нЁЖакдг╟явогЮ╠╕╫ёё╛╩КиМр╩уПё╛вогЮ╠╕╫ё╢с╩ЁюО╣ТакЁЖю╢",
        "х╨яЩё╨╟║ё©[1;36mвогЮ╠╕╫ёё║[2;37;0m",
        "еёд╖мУё╨хцнрю╢ё║",
        "воо╪ё╨(гюохй╟фП╠╕╫ё)ц╩спуБжжйб║ёуБ╦Жж╩╡╩╧Щйгнр╦З╢С╪р©╙╣др╩╦ЖмФп╕",
        "х╨яЩё╨©╙мФп╕ё©",
        "воо╪ё╨уБ╟я╫ёк╜╟н╣цЁЖк╜╟н╡╩ЁЖ╦Ы╠╬ц╩сп╧ьо╣║ё(к╣мЙв╙иМоР╨Ст╨въх╔)",
        "еёд╖мУё╨╟║ё©дЦцгуБп╘╩Л╣╟ё╛тзнр╣ьело╧╫а╨мё╛к╜╦рвХнрк╜╬мкюё║",
        "уБй╠лЗих╧╚жВю╢ак║ёжавП╠╕ЁцброР╨Ст╨в╥х╔ё╛оЦоЦтзр╩ет©╢тзяшюО║ё",
        "жавП╠╕тз╨Ст╨юОур╣╫воо╪║ё",
        "жавП╠╕ё╨╟╔я╫ё╛дЦтУц╢╤ЦтзуБюОя╫ё©",
        "м╩х╩воо╪╟нЁЖ╠╕╫ё╣жтзжавП╠╕╣дяй╨Мио║ё",
        "",
        "..........",
        "ет╟вё╨╣╠й╠дг╟я╫ёюКнр╣д╨МаЭж╩сп0.01╧╚╥жё╛╣╚йгкд╥жж╝р╩ЛдоЦж╝╨Сё╛дг╟я╫ё╣де╝жВхк╫╚╩АЁ╧╣в╣ь╟╝ионр",
        "ет╟вё╨рРн╙нр╬Ж╤╗к╣р╩╦Ж╩я╩╟║ёкДх╩╠╬хкиЗф╫к╣акнчйЩ╣д╩я╩╟ё╛╣╚йгуБр╩╦Жнрхон╙йгвНмЙцю╣д║╜║╜",
        "воо╪ё╨дЦтымЫг╟╟К╡╫нр╬м╟ядЦ╦Ьи╠акё║",
        "жавП╠╕ё╨дЦс╕╦цуБц╢вЖё╛нрр╡с╕╦цкю║ётЬ╬╜спр╩╥щуФЁо╣д╟╝гИ╥етзнрцФг╟ё╛нрц╩спуДо╖ё╛╣хнрй╖х╔╣дй╠╨Рнр╡е╨С╩зд╙╪╟║ё",
        "жавП╠╕ё╨хкйю╪ДвНм╢©Ю╣дйбд╙╧Щсз╢к║ёдЦ╣д╫ётзнр╣дяй╨Мио╦Нобх╔╟иё║╡╩сцтыслт╔акё║",
        "жавП╠╕ё╨хГ╧ШиолЛдэ╧╩╦Ьнрр╩╦Жтыю╢р╩╢н╣д╩З╩Аё╛нр╩А╤тдг╦Же╝╨╒вск╣хЩ╦Жвжё╨нр╟╝дЦ║ё",
        "жавП╠╕ё╨хГ╧Ш╥гр╙тзуБ╥щ╟╝ио╪с╦Жфзочё╛нроёмШйг║╜║╜р╩мРдЙё║",
        "║╟г╨Ю╔║╠р╩иЫ╠╕╫ёбД╣ьё╛воо╪╦п╤╞╣цюАаВбЗцФ║ё",
        "воо╪ё╨дгц╢ё╛дЦтУц╢оРдЦдОвс╫╩╢Здьё©",
        "жавП╠╕ё╨р╩╤╗р╙╫╩╢Зё║кЫртнрр╩╤╗р╙дц╩ьдг╦Жтб╧Б╠╕╨п╢ЬдЦр╩фП╩ьх╔╦ЗкШцгк╣гЕЁЧ║ё",
        "жавП╠╕ё╨нр╡╩╧э╠ПхктУц╢к╣нрё╛нрр╡╡╩еб╨Сйю╩Аспг╖г╖мРмР╣дхк╤тнрмыбНё╛нрр╩╦ЖхкЁп╣ёобю╢║ё",
        "воо╪ё╨дЦ╡╩╩Аф╜нр╟иё©",
        "жавП╠╕ё╨╣╚йгё╛нрм╢╨чнрвт╪╨ё╛ц╩сп╠╬йбдц╩ьдг╦Жтб╧Б╠╕╨пё╛нр║╜║╜",
        "воо╪ё╨нр╟ОдЦё║",
        "жавП╠╕ё╨╡╩сцё╛л╚нёоуак║ё",
        "воо╪ё╨дЦ╡╩оКё©",
        "жавП╠╕ё╨оКё║ё║ё║║╜║╜",
        "уБй╠еёд╖мУ╨млЗих╧╚жВю╢ак║ё",
        "лЗих╧╚жВё╨╨ъё╛дЦцгтзуБ╤Ы╦ибОё©",
        "жавП╠╕╨мвоо╪╡╩сО║ё",
        "лЗих╧╚жВё╨кЩйгк╜я╫ё©нрнйдЦя╫ё╛кЩйгк╜ё©",
        "еёд╖мУё╨кЩ║╜║╜ом╣эё╛кЩйгк╜дЦк╣╟║ё║",
        "жавП╠╕ё╨кЩ║╜║╜йгнр╣д╥╒фч║ё",
        "еёд╖мУё╨мшё║ом╣эё╛дЦл╚╧Щ╥жакё║",
        "еёд╖мУ(╣миЫ╣ь)ё╛╨Овсё╛╨ц╦Гцг╤Ы║ё",
        "лЗих╧╚жВё╨еёд╖мУё║ё║дЦ╬сх╩╩╧╟яцццц╪ч╦ЬкШё©",
        "еёд╖мУё╨кЫрткШюофе©╢╡╩╧Щх╔ё╛сц╫ёж╦векШя╫║ё",
        "лЗих╧╚жВё╨дЦ╦Знр╧Щю╢ё╛нрсп╩╟р╙нйдЦё║",
        "лЗих╧╚жВ╫╚жавП╠╕в╖╣╫р╩╠ъх╔║ё",
        "воо╪ё╨еёд╖мУё║т╜ю╢дЦспюофе╟║║╜║╜",
        "еёд╖мУё╨╟╔║╜║╜╦пгИффаяак║ё",
        "",
        "уБй╠аМмБр╩╠ъ",
        "лЗих╧╚жВё╨дЦ╦Знрк╣гЕЁЧё╛╣╫╣в╥╒иЗй╡ц╢йбакё©",
        "жавП╠╕ё╨нрк╣╧Щакё╛╢Си╘║╜║╜║╜║╜",
        "лЗих╧╚жВё╨╟║ё╛дЦ╫пнр╢Си╘ё©",
        "жавП╠╕ё╨╤т╡╩фПё╛с╕╦цйгеё╥Рхк║ё",
        "лЗих╧╚жВё╨еёд╖мУртг╟еЦнр©╢тбаа╣дй╠╨Рё╛╫пхк╪рп║лПлПё╛ожтзпбхкй╓╬ихкакё╛╫пхк╪реё╥Рхкё║",
        "жавП╠╕ё╨п║лПлПё©ё║",
        "лЗих╧╚жВё╨дЦртн╙нруБц╢па©Юю╢уБюОуФ╣дйгн╙акуБлУЁТеёбПё©йгн╙акдЦуБ╦Жц╩спа╪пд╣дЁТ╨Овс╟║ё║",
        "лЗих╧╚жВсца╕фЧвежавП╠╕",
        "жавП╠╕ё╨╟║ё║╟╔я╫ё║╟╔я╫ё║",
        "еёд╖мУё╨(тзт╤╢╕©╢веё╛╡╩цВгИ©Ж)ом╣эё╛уФйгдян╙дЦакё║╨цпж╣эё║ё║ё║ё║ё║ё║",
        "",
        "╧шжзё╨║╜║╜мбя╙║╜║╜",
          (: give_gift :),

});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

string give_gift()
{
        STORY_D->give_gift("/clone/gift/ziqingbaojian", 1,
                           HIM "\n║╟╨Д║╠╣др╩иЫр╩╟яЁ╓фъцв╟К╣двогЮ╠╕╫ё╣Т╣╫дЦцФг╟║ё\n\n" NOR);//нр╣дпнхщ╢й╡╩╢М╟и.(snicker)
        return HIM "лЩк╣дЁхк╟нЁЖак╢╚к╣жп╣д[1;36mвогЮ╠╕╫ё║ё[2;37;0m\n" NOR;

}
