//By tianlin@mhxy for 2002.1.9

#include <ansi.h>

int give_gift();

private mixed *story = ({
        "¹ØÓğ£ºÌıËµÈıµÜÄãÔÚ³¤°åÇÅÒ»ÏÂ×ÓÏÅÅÜÁË¼¸Ê®Íò´ó¾ü£¬ºÃÀ÷º¦°¡¡£",
        "ÕÅ·É£ºÄÇÊÇ×ÔÈ»£¬ÎÒ³ÔÁËÉñÁ¦Íè£¬¹¦Á¦ÊÇ¸üÊ¤ÍùÎô£¡",
        "¹ØÓğ£ºßõßõ£¬Õæ²»´í£¬ÈıµÜ»¹ÓĞÃ»ÓĞ£¿",
        "ÕÅ·ÉÈû¸ø¹ØÓğÒ»¿ÅÉñÁ¦Íè£¬µÀ£ºÎÒÕâ»¹¶à×ÅÄØ¡£",
        "¹ØÓğ£ººÙºÙ£¡",
        "ÕÅ·É£ºàŞ£¡¶ş¸ç£¬ÓĞ¼şÊÂÍüËµÁË£¬¾İËµ³ÔÍêÒÔºóÈËµÄÁ³É«»á±ä¡£",
        "¹ØÓğ£º£¿ÔõÃ´±ä£¿",
        "ÕÅ·É£ºÏñÎÒ£¬°×Á³±äºÚÁ³ßÂ£¬ÍùÏà·´µÄ·½Ïò±äÂï¡£",
        "¹ØÓğ£º¿¿£¡ÄÇÎÒ²»ÊÇÒª±ä³ÉÂÌÁ³ÁË£¿",
        "ÕÅ·É£ºÓ¦¸Ã¡£",
        "¹ØÓğºİºİµÄ°Ñ[1;32mÉñÁ¦Íè[2;37;0m[37mÈÓÁË³öÈ¥¡£",
        (: give_gift :),
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/clone/gift/shenliwan", 1,
                           HIM "\n¡°Å¾¡±µÄÒ»ÉùÒ»Ã¶ÉñÁ¦Íèµôµ½ÄãÃæÇ°¡£\n\n" NOR);
        return 0;
}
