//By tianlin@mhxy for 2002.1.9

#include <ansi.h>
int give_gift();
mixed *story = 
({
        "王母娘娘做寿，玉帝大摆酒席，山珍海味无所不用其极，饭前准备",
        "小菜，饭中大菜，饭后甜点吃的诸位天神直打饱嗝，席上幺五喝六",
        "觥筹交错，仙酒仙果芳香弥散，沁入肺腑，天界瑶池，非人间可比！",
        "酒酣耳热时，玉帝招侍卫一干人等，要取蟠桃祝寿，太白金星和太",
        "上老君并托塔天王李靖去御花园。",
        "李靖：“红孩儿！”",
        "红孩儿：“孩儿在！”",
        "“你爬树摘桃子去！”",
        "红孩儿摘了一个桃子，不敢自己偷吃，没办法只好扔过来，刚好打在",
        "太白金星头上。",
        "“你这孩子也太调皮了，怎么可以这样欺负老人家呢？你看看哎呀太",
        "白金星都一大把年纪了，就算平时不给你买巧克力你也不应该这样嘛",
        "这蟠桃都是天上几千年才结果的神树啊，不可以这样随便扔嘛，就算",
        "乱扔果皮纸屑也是不应该的呀，你看看我还没说完你就又打到我的头",
        "了，哎呀……”",
        "“都怪我管教无方，使两位仙君……红孩儿，你给我好好干活！”",
        "红孩儿愤愤地摘了一个蟠桃用力抛了过来，结果越过三人头顶，掉下",
        "去了……”",
        (: give_gift :),
        HIM"听说天庭掉下来一个蟠桃……”"NOR,
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

int give_gift()
{
        STORY_D->give_gift("/clone/gift/obj/pantao", 1,
                           HIM "\n一颗蟠桃从天而降，掉到你的面前。\n\n" NOR);
        return 0;
}
