//By tianlin@mhxy for 2002.1.9
//×Ô°×»°Î÷ÓÎÉÏÕª³­.
//by tianlin 2001.5.1

#include <ansi.h>

string give_gift();

private mixed *story = ({
        "¡­¡­",
        "",
        "¹ÛÒô£ºËïÎò¿Õ£¬ÄãÕâ¸öÐóÉü£¬Äã±¾À´´ðÓ¦ÈçÀ´·ð×æ»¤ËÍÄãÊ¦¸µÌÆÈý²ØÈ¥È¡Î÷¾­µÄ£¬Äã¾ÓÈ»¸úÅ£Ä§Íõ´®Í¨Òª³ÔÄãÊ¦¸µ£¬ÄãÖª²»ÖªµÀÄã·¸ÁËÃÖÌì´ó×ï£¿",
        "ËïÎò¿Õ£ºÉÙÂÞàÂ£¡Äã×·ÁËÎÒÈýÌìÈýÒ¹£¬ÒòÎªÄãÊÇÅ®ÈËÎÒ²Å²»É±Äã£¬²»ÒªÒÔÎªÎÒÅÂÁËÄã£¡",
        "ÌÆÉ®£ºÎò¿Õ£¬ÄãÔõÃ´¿ÉÒÔÕâÑù¸ú¹ÛÒô½ã½ã½²»°ÄØ£¿",
        "Îò¿Õ£º»©£¡²»Òª³³£¡",
        "ÌÆÉ®£ºÄãÓÖÔÚÏÅÎÒ£¡",
        "¹ÛÒô£ºÄã²»ÊÇÅÂÎÒÓÖÎªÊ²Ã´Òª´òÉË×ÏÏ¼ÏÉ×ÓÇÀËýµÄÔÂ¹â±¦ºÐÄØ£¿Äã²»¾ÍÊÇÏë¶ã¿ªÎÒÂð£¿",
        "Îò¿Õ£º¼ÈÈ»¶ã²»ÁË£¬ÄÇÀÏËï¾Í¸úÄã¾øÒ»ËÀÕ½£¡",
        "Îò¿Õ½«ÔÂ¹â±¦ºÐËæÊÖÒ»Å×£¬ÕýºÃÔÒÔÚÌÆÉ®Í·ÉÏ¡­¡­",
        "ÌÆÉ®ÃÔ»óµÀ£º¡°ß×£¿¡±ÓÖÒª¸ÉÊ²Ã´£¿",
        "ºï×ÓÕýÒª¶¯ÊÖ£¬Í»È»¡­¡­",
        "ÌÆÉ®£º°¦°¦°¦£¬´ó¼Ò²»ÒªÉúÆø£¬ÉúÆø»á·¸ÁËàÁ½äµÄ£¡Îò¿ÕÄãÒ²Ì«µ÷Æ¤ÁË°É¡£",
        "ÌÆÉ®£ºÎÒ¸úÄãËµ¹ý£¬½ÐÄã²»ÒªÂÒÈÓ¶«Î÷¡£ÂÒÈÓ¶«Î÷ÕâÃ´¶à¡­¡­Äã¿´ÎÒ»¹Ã»ËµÍêÄØ£¬Äã°Ñ¹÷×ÓÓÖ¸øÈÓµôÁË£¡",
        "ÌÆÉ®£ºÔÂ¹â±¦ºÐÊÇ±¦Îï£¬Äã°ÑËüÈÓµô»áÎÛÈ¾»·¾³¡£°¦£¬ÒªÊÇÔÒµ½Ð¡ÅóÓÑÄØ£¬ÔõÃ´°ì£¿",
        "ÌÆÉ®£º¾ÍËãÃ»ÓÐÔÒµ½Ð¡ÅóÓÑ£¬ÔÒµ½ÄÇÐ©»¨»¨²Ý²ÝÒ²ÊÇ²»¶ÔµÄÑ½",
        "ÖÚÈË¿ñÅçÏÊÑª¡­¡­",
        "Îò¿ÕÒ»°Ñ×¥×¡ÌÆÉ®ÊÖÖÐµÄÔÂ¹â±¦ºÐ",
        "ÌÆÉ®£º¸ÉÊ²Ã´£¿",
        "Îò¿Õ£º·ÅÊÖ£¬°Ñ¶«Î÷¸øÎÒ£¡",
        "ÌÆÉ®£ºÄãÏëÒª°¡£¿Îò¿Õ£¬ÄãÏëÒªµÄ»°Äã¾ÍËµ»°Âï¡£Äã²»ËµÎÒÔõÃ´ÖªµÀÄãÏëÒªÄØ£¿ËäÈ»ÄãºÜÓÐ³ÏÒâµØ¿´×ÅÎÒ",
        "ÌÆÉ®£º¿ÉÊÇÄã»¹ÊÇÒª¸úÎÒËµÄãÏëÒªµÄ¡£ÄãÕæµÄÏëÒªÂð£¿ÄÇÄã¾ÍÄÃÈ¥°É£¡Äã²»ÊÇÕæµÄÏëÒª°É£¿ÄÑµÀÄãÕæµÄÏëÒªÂð£¿¡­¡­",
        "Îò¿Õ£ºÎÒKao£¡Ëµ°ÕÒ»¸öºïÈ­½«ÌÆÉ®´òµÄ±Ç¿ÚÅçÑª¡£",
        "¹ÛÒô£º°¡£¿ËïÎò¿Õ£¡£¡£¡Äã£¡£¡£¡",
        "Îò¿Õ£º´ó¼Ò¿´µ½À²£¿Õâ¸ö¼Ò»ïÃ»ÊÂ¾Í³¤Æª´óÂÛÆÅÆÅÂèÂèß´ß´ÍáÍá£¬¾ÍºÃÏóÕûÌìÓÐÒ»Ö»²ÔÓ¬£¬ÎË¡­¡­",
        "Îò¿Õ£º²»ÊÇÒ»Ö»£¬ÊÇÒ»¶Ñ²ÔÓ¬Î§×ÅÄãÑ½£¬ÎË¡­ÎË¡­ÎË¡­ÎË¡­·Éµ½ÄãµÄ¶ú¶äÀïÃæ¡£¾ÈÃü°¡£¡¾ÈÃü°¡£¡",
        "Îò¿Õµ¹µØ·­¹ö£¬Òì³£Í´¿à¡­¡­",
        "Îò¿Õ£ºËùÒÔÄØÎÒ¾Í×¥×¡²ÔÓ¬¼·ÆÆËüµÄ¶ÇÆ¤°ÑËüµÄ³¦×Ó³¶³öÀ´ÔÙÓÃËüµÄ³¦×ÓÀÕ×¡ËüµÄ²±×ÓÓÃÁ¦Ò»À­£¬ºÇ¡¤£¤£¤¡¤#",
        "Îò¿Õ£ºÕûÌõÉàÍ·¶¼Éì³öÀ´À²£¡ÎÒÔÙÊÖÆðµ¶Âä£¬»©£­£­£¡Õû¸öÊÀ½çÇå¾»ÁË¡£ÏÖÔÚ´ó¼ÒÃ÷°×£¬ÎªÊ²Ã´£¬ÎÒÒªÉ±Ëû£¡",
        "¹ÛÒô£ººß£¡Îò¿Õ£¬ÄãÖî¶à½è¿Ú£¬Äã¸ù±¾¾Í²»ÏëÈ¥È¡Î÷¾­£¡",
        "ÌÆÉ®£º½ã½ã£¬ÕâÊÇÄãµÄ²»¶ÔÁË£¡",
        "¹ÛÒôÆÐÈøÃÔ»óµÀ£º¡°ß×£¿¡±",
        "ÌÆÉ®£ºÎò¿ÕËûÒª³ÔÎÒ£¬Ö»²»¹ýÊÇÒ»¸ö¹¹Ë¼£¬»¹Ã»ÓÐ³ÉÎªÊÂÊµ£¬ÄãÓÖÃ»ÓÐÖ¤¾Ý£¬ËûÓÖºÎ×ïÖ®ÓÐÄØ£¿",
        "ÌÆÉ®£º²»ÈçµÈËû³ÔÁËÎÒÖ®ºó£¬ÄãÓÐÆ¾ÓÐ¾Ý£¬ÔÙ¶¨ËûµÄ×ïÒ²²»³Ù°¡£¡",
        "¹ÛÒô£ºÈý²Ø£¬ÄãÂÞàÂÎÒÔç¾ÍÌýËµ¹ýÁË£¬²»¹ýÃ»Ïëµ½Äã¾ÓÈ»ÕâÃ´ÂÞàÂ£¡ÎÒ¸øÄãµÄ½ô¹¿ÖäÖÆ·üÕâºï×ÓÄã¾ÓÈ»²»ÓÃ£¡",
        "ÌÆÉ®£º°¦£¬ÄÇ¸ö½ð¸ÕÈ¦³ß´çÌ«²î£¬Ç°ÖØºóÇá×ó¿íÓÒÕ­£¬Ëû´øÉÏÖ®ºóºÜ²»Êæ·þ£¬ÕûÍíÊ§Ãß£¬»áÁ¬ÀÛÎÒÂï£¡",
        "ÌÆÉ®£ºËûËäÈ»ÊÇ¸öºï×Ó£¬¿ÉÊÇÄãÒ²²»ÄÜÕâÑù¶ÔËû£¬¹Ù¸®ÖªµÀÁË»áËµÎÒÅ°´ý¶¯ÎïµÄ£¡",
        "ÌÆÉ®£ºÄÇ½ô¹¿Öä£¬°¡£¬È¥ÄêÎÒÔÚ³Â¼Ò´åÈÏÊ¶ÁËÒ»Î»Ìú½³£¬ËûÊÖ¹¤¾«ÃÀ¡¢¼ÛÇ®ÓÖ¹«µÀ¡¢Í¯ÛÅÎÞÆÛ£¬¸É´àÎÒ½éÉÜÄãÔÙ¶¨×öÒ»¸ö°É£¡",
        "¹ÛÒô£º±Õ×ì£¡Èý²ØÍºÂ¿",
        "Îò¿ÕºÍ¹ÛÒôÍ¬Ê±ÉìÊÖÈ¥ÆþÌÆÉ®µÄ²±×Ó£¬¸ÕÒ»Æþ×Å£¬¹ÛÒô²ÅÃÍÈ»¾ª¾õ£¬¼±Ã¦Ëõ»ØÊÖÈ¥¡£",
        "¹ÛÒô£º×ï¹ý×ï¹ý£¡",
        "Îò¿Õ£ºÏÖÔÚÄãÒ²Ìå»áÎÒµÄÍ´¿àÁË°É£¿»Ø´ðÎÒ£¡",
        "¹ÛÒô£ºÆÃºï£¬½ñÌìÎÒÒªÌæÌìÐÐµÀ£¡",
        "Îò¿Õ£º³ôÈý°Ë£¬ËµÄÇÃ´¶à·Ï»°¸ÉÂï£¬³ÔÎÒÒ»°ô£¡",
        "Á½ÈËÒ»·¬¶··¨£¬Îò¿Õ±»¹ÛÒô½µ·þÊÕÈë¸ÊÂ¶Æ¿¡£",
        "¹ÛÒô£º½ñÌìÎÒÒª½«ÕâÆÃºïÉíÊ×Òì´¦¡£",
        "ÌÆÉ®£ºÍ½µÜÓÐ´í×öÊ¦¸µµÄÒ²ÓÐÔðÈÎ£¬Çó½ã½ã·ÅËûÒ»ÌõÉúÂ·°É",
        "¹ÛÒô£ºÎÒ²»ÏûÃðËûÎÒÃ»·¨ÏòÓñ»Ê´óµÛ½»´ú£¡",
        "ÌÆÉ®£ºÎÒ²»»áÊ¹ÄãÎªÄÑµÄ¡£Çë¹ÛÒô½ã½ã¸úÓñ»Ê´óµÛËµÒ»Éù£¬Æ¶É®Ô¸ÒâÒ»ÃüÅâÒ»Ãü£¡ÕýËùÎ½ÎÒ²»ÈëµØÓüË­ÈëµØÓü£¿",
        "ÌÆÉ®£ºÇó½ã½ãÄãÌåÁÂ£¬ÎÒÕâÑù×ö£¬ÎÞ·ÇÊÇÏë¸Ð»¯ÁÓÍ½£¬ÒÔÅäºÏÎÒ·ð´È±¯µÄ´óÎÞÎ· ¾«Éñ°¡£¡",
        "à«ß¼°¢ÃÖÍÓ·ð£¬ÌÆÉ®ºÏÊ®×øµØ£¬½«·¨ÕÈÏò¿ÕÖÐÒ»Å×¡£",
        "Ò»ÉùÉ±Öí°ãµÄ½ÐÉù´«À´¡­¡­·¨ÕÈ½«Ä³ÈËÔÒËÀ¡£",
        "¡­¡­¡­¡­",
          (: give_gift :),

});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}

string give_gift()
{
        STORY_D->give_gift("/clone/gift/staff", 1,
                           HIM "\n¡°ºä¡±µÄÒ»Éù¸ù[1;33m¾Å»·ÎýÕÈ[2;37;0mµôµ½ÄãÃæÇ°¡£\n\n" NOR);//ÎÒµÄÐÎÈÝ´Ê²»´í°É.(snicker)
        return HIM "ÌýËµÄ³ÈËµÃµ½ÁË´«ËµÖÐµÄ[1;33m¾Å»·ÎýÕÈ¡£\n" NOR;

}
