//By tianlin@mhxy for 2002.1.20

#include <ansi.h>

private mixed *story = ({
        "天兵甲：喂！你看，那个人又坐在那里发呆了。连续几天都这样，延误我们哥俩关门收工的时间嘛？",
        "天兵乙：是啊，整天傻坐在那里自言自语，说什么结发的妻子在天那边，还不停地流泪。看看他那副德性，鬼鬼祟祟丢人现眼，披头散发人模狗样。",
        "天兵甲：他的妻子是谁啊？",
        "天兵乙：从他的口气听好象是上次打伤我们哥俩逃下凡间的那个紫霞仙子。",
        "天兵甲：哗！紫霞仙子！不会吧？紫霞仙子那样美丽纯真，像我这么有理智的人怎么可能相信紫霞仙子是他的妻子这种无稽的事情呢？",
        "天兵乙：嘘。小声点！他刚调到这里来做事的，好象被如来佛主封了个什么斗战胜佛，最好少惹他。",
        "天兵甲：我KAO！斗战胜佛，很有名吗？干嘛给他面子！",
        "天兵乙：不是啊，听说他以前叫做齐天大圣，好象很能打的。",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}
