// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第二狱");
         set ("long", @LONG
                
                                           /\ /\
                                          /  \---._
                                         / / `     `\
                                         \ \   `'<@)@)      
                                         /`         ~ ~._ 
                                        /                `() 
                                       /    \   (` ,_.:.  /
                                      / ~    `\   (vVvvvvV
                                     /       |`\_ `^^^/
                                 ___/________|_  `---'
                                (_____R_E_X____) _
                                _/~          | `(_)
                              _/~             \  
                            _/~               |
                          _/~                 |
                        _/~                   |
                      _/~         ~.          |
                    _/~             \        /\
                 __/~               /`\     `||
               _/~      ~~-._     /~   \     ||
              /~             ~./~'      \    |)
             /                 ~.        \   )|
            /                    :       |   ||
              |                    :       |   ||
            |                   .'       |   ||
       __.-`                __.'--.      |   |`---. 
    .-~  ___.         __.--~`--.))))     |   `---.)))
   `---~~     `-...--.________)))))      \_____)))))
这里就是冥界第二狱----犯贪婪的罪人，要被重而冷的雨吹打，
还要做看守的地狱犬的粮食
  
LONG);
                     
set("exits", ([
      "westdown": __DIR__"huatian",
            "eastup": __DIR__"gu",
    
        ]));

  set("objects", ([ 
	"/d/mingjie/npc/falaao":1,
        ]));

        setup();
}
