// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第六狱----第二谷");
         set ("long", @LONG
             _(_)_                            wWWWw
   @@@@       (_)@(_)  vVVVv    _     @@@@  (___)
  @@()@@ wWWWw  (_)\   (___)  _(_)_  @@()@@   Y
   @@@@  (___)     `|/   Y   (_)@(_)  @@@@   \|/
    /      Y       \|   \|/   /(_)    \|      |/
 \ |     \ |/       | /\ | / \|/       |/    \|
   |///  \\|/// \\\\|//\\|///\|///  \\\|//  \\|//
^^^^^^  ^^^^^^^^^^^^^  ^^^^^^^^^^^^^^^  ^^^^^
……………………………………………………………………………………
这里就是冥界第六狱第二谷----自杀而死的罪人，堕落在森林地狱
LONG);
                     
set("exits", ([
      "westdown": __DIR__"liu2",
            "eastup": __DIR__"liu",
    
        ]));

  set("objects", ([ 
        ]));

        setup();
}
