// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第六狱----第三谷");
         set ("long", @LONG
/  //  //  //  //  //  //  //  //  //  //  //  //  ///  //  //  //   
/ //  // / //  //  //  //  //  //  //  //  //  //  //  //  // /  //   
///  /// //_.-' //  //  //  //  //  //  //  //  //  //  // /  //  //
//  ///_.-' _..--      //  //  //  //  //  //  // /  //  //  //  //
   / (_..-' // //  //  //  //  //  //  // /  //  //  //  /// ///
   / // // //  //  //  //  //  //  //  // /  //  //  //  /// //  
这里就是冥界第六狱第三谷----沉迷于不正常快乐的人，堕落在热沙地狱
LONG);
                     
set("exits", ([
      "westdown": __DIR__"xue",
            "eastup": __DIR__"liu1",
    
        ]));

  set("objects", ([ 
	"/d/mingjie/npc/aluli":1,

        ]));

        setup();
}
