// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第七狱----第一壕");
         set ("long", @LONG
            .======.
              | INRI |
              |      |
              |      |
     .========'      '========.
     |   _      xxxx      _   |
     |  /_;-.__ / _\  _.-;_\  |
     |     `-._`'`_/'`.-'     |
     '========.`\   /`========'
              | |  / |
              |/-.(  |
              |\_._\ |
              | \ \`;|
              |  > |/|
              | / // |
              | |//  |
              | \(\  |
              |  ``  |
              |      |
              |      |
              |      |
              |      |
  \\jgs _  _\\| \//  |//_   _ \// _
 ^ `^`^ ^`` `^ ^` ``^^`  `^^` `^ `^
这里就是冥界第七狱第一壕----贩卖女人的罪人，会在这里遭到鞭打
  
LONG);
                     
set("exits", ([
      "westdown": __DIR__"qi1",
            "eastup": __DIR__"xue",
    
        ]));

  set("objects", ([ 
        ]));

        setup();
}
