// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第七狱----第三壕");
         set ("long", @LONG
      /\    /\    /\    /\    /\    /\    /\
      \/    \/    \/    \/    \/    \/    \/
   /\ || /\ || /\ || /\ || /\ || /\ || /\ || /\
   \/_||_\/_||_\/_||_\/_||_\/_||_\/_||_\/_||_\/
   ||____||____||____||____||____||____||____||
这里就是冥界第七狱第三壕----利用圣职身份做坏事的人，要在这里被蜡烛烧
  
LONG);
                     
set("exits", ([
      "westdown": __DIR__"qi3",
            "eastup": __DIR__"qi1",
    
        ]));

  set("objects", ([ 
        ]));

        setup();
}
