// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第七狱----第七壕");
         set ("long", @LONG
                      /^\/^\
                  _|__|  O|
         \/     /~     \_/ \
          \____|__________/  \
                 \_______      \
                         `\     \                 \
                           |     |                  \
                          /      /                    \
                         /     /                       \\
                       /      /                         \ \
                      /     /                            \  \
                    /     /             _----_            \   \
                   /     /           _-~      ~-_         |   |
                  (      (        _-~    _--_    ~-_     _/   |
                   \      ~-____-~    _-~    ~-_    ~-_-~    /
                     ~-_           _-~          ~-_       _-~   
                        ~--______-~                ~-___-~
这里就是冥界第七狱第七壕----犯了偷盗罪的罪人，将堕落到蛇地狱受苦
  
LONG);
                     
set("exits", ([
      "southeast": __DIR__"qi7",
            "northwest": __DIR__"qi5",
    
        ]));

  set("objects", ([ 
        ]));

        setup();
}
