// /d/guzhanchang/pomiao.c
inherit ROOM;
void create()
{
        set("short", "第五狱");
         set ("long", @LONG
                                |~~~~~~~|
                                    |       |
                                    |       | 
                                    |       |
                                    |       |
                                    |       |                             
         |~.\\\_\~~~~~~~~~~~~~~xx~~~         ~~~~~~~~~~~~~~~~~~~~~/_//;~|
         |  \  o \_         ,XXXXX),                         _..-~ o /  |
         |    ~~\  ~-.     XXXXX`)))),                 _.--~~   .-~~~   |
          ~~~~~~~`\   ~\~~~XXX' _/ ';))     |~~~~~~..-~     _.-~ ~~~~~~~ 
                   `\   ~~--`_\~\, ;;;\)__.---.~~~      _.-~
                     ~-.       `:;;/;; \          _..-~~
                        ~-._      `''        /-~-~ 
                            `\              /  /
                              |         ,   | |
这里就是冥界第五狱----不遵守神的教诲的罪人，堕落在无数的墓碑之中，
受火焰的痛苦
LONG);
                     
set("exits", ([
      "eastdown": __DIR__"liu",
    
        ]));

  set("objects", ([ 
	"/d/mingjie/npc/gaosi":1,
        ]));

        setup();
}
