// Room: /u/tianlin/workroom.c
inherit ROOM;
void create()
{
 set("short", "ë…¾Ó");
  set ("long", @LONG

      ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ        ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ                      ¡ñ      
              ¡ñ                ¡ñ          ¡ñ      ¡ñ¡ñ¡ñ¡ñ¡ñ  ¡ñ  ¡ñ      
    ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ      ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ        ¡ñ  ¡ñ    ¡ñ¡ñ¡ñ¡ñ¡ñ  
    ¡ñ        ¡ñ        ¡ñ      ¡ñ          ¡ñ      ¡ñ¡ñ¡ñ¡ñ¡ñ  ¡ñ  ¡ñ      
      ¡ñ¡ñ¡ñ  ¡ñ  ¡ñ¡ñ¡ñ    ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ  ¡ñ  ¡ñ  ¡ñ      ¡ñ      
                                ¡ñ    ¡ñ            ¡ñ¡ñ  ¡ñ¡ñ  ¡ñ¡ñ¡ñ¡ñ¡ñ  
      ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ        ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ    ¡ñ      ¡ñ              
                                ¡ñ    ¡ñ      ¡ñ    ¡ñ¡ñ¡ñ¡ñ¡ñ  ¡ñ¡ñ¡ñ¡ñ¡ñ  
    ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ      ¡ñ  ¡ñ¡ñ¡ñ  ¡ñ      ¡ñ      ¡ñ  ¡ñ      ¡ñ  
          ¡ñ        ¡ñ      ¡ñ¡ñ¡ñ¡ñ  ¡ñ  ¡ñ¡ñ      ¡ñ¡ñ¡ñ¡ñ¡ñ  ¡ñ      ¡ñ        
      ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ¡ñ              ¡ñ¡ñ    ¡ñ¡ñ  ¡ñ      ¡ñ  ¡ñ¡ñ¡ñ¡ñ¡ñ  
LONG
);
  set("exits", ([ /* sizeof() == fuckyou */
             "west" : __DIR__"bedroom",
       "down" : "/u/linger/workroom",
             "out" : __DIR__"guardroom",
         "kz" : "/d/city/kezhan",
          "up" : "/u/tianlin/workroom",
  ]));    

    setup();
     replace_program(ROOM);
}
