// story:nuerguo
// By tianlin@mhxy 2001.5.1,制作一个nuerguo故事,喜剧类型

#include <ansi.h>

private mixed *story = ({
        "话说这一日，唐僧师徒四人行至一国度，抬头见城门上书三字“女儿国”。 ",
        "",
        "唐僧：我KAO！有没有搞~~~~~错？居然全都是~~~娘们？！ ",
        "孙悟空：我说，你能不能斯文点。睁那么大个眼干嘛？就说你呢，瞧你那样，就知道是个文盲，还愣说自己是个佛大本科。 ",
        "唐僧：怎么了，佛大本科就不能说粗话了。跟你说，咱知识份子就不兴骂骂娘抒抒情了？ ",
        "沙僧：师父，这就是你不对了。。。。。。 ",
        "唐僧：STOP！老三，不是我说你，你们三，就你话最多，整天啰里啰嗦叽叽歪歪，简直就是一只。。。不，是一堆苍蝇围着人转。。。。。。要不我怎么不让八戒挑担子啊？挑个那么重的担子还那么多话，要不要把紧箍咒也给你一个！？ ",
        "沙僧：$#@%$ ",
        "猪八戒：是啊，师父你老真是慧眼。 ",
        "唐僧：还是八戒是我知音。 ",
        "猪八戒：我对师父您的景仰之情有如滔滔江水连绵不绝，更有如黄河泛滥一发而不可收拾。。。。。。但师父您这次用词也该用个新点的词。 ",
        "唐僧：那照你的意思不用“娘们”用什么好？ ",
        "孙悟空，猪八戒，沙僧异口同声：MM！ ",
        "唐僧：我KAO！你们三是谁又偷看我上网聊天啦？ ",
        "猪八戒：老猪我昨天。。。。。。长夜漫漫无心睡眠，正眨着眼看月亮呢，无意中看见师父正流着口水敲着键盘跟观音姐姐。。。。。。 ",
        "唐僧：八戒，我看你这些天走得怪累的，这样吧，以后这匹马你骑，还有以后宵夜多分你一份。 ",
        "白龙马：不行，我本来驮着你就怪累的慌，你现在叫我驮这个死肥猪。。。。。。当心我到动物保护协会告你虐待动物！再怎么说，我好歹也是东海龙王三太子啊！ ",
        "唐僧：得，那以后让沙僧背着你得了。 ",
        "沙僧：为什么又是我！！！！ ",
        "唐僧：不是你难道是悟空啊，要不，你跟他单挑试试。 ",
        "沙僧：得，算我倒霉还不行么？ ",
        "唐僧：对了，八戒，你看见我跟观音姐姐干嘛呢？ ",
        "猪八戒：我瞧见您正跟观音姐姐一心一意研究佛法呢，真叫弟子感动不已！ ",
        "孙悟空跟沙僧在一旁呕吐不已。 ",
        "正在此时，路旁突然跳出一个带红箍的老太太。 ",
        "老太太：干什么呢？把这当你们家公共厕所了，知不知道你们这样随地大。。。不，随地乱吐会污染环境的？来，每人罚款5两白银！ ",
        "孙悟空、沙僧：有没有搞~~~~~错！ ",
        "老太太：没有搞~~~~~~错！ ",
        "沙僧从荷包里掏出5两碎银：大妈，这可是俺挑了三个月担子换来的的血汗钱哪，您老可省着点花。 ",
        "老太太：什么，你叫我大妈。跟你说大胡子我还不老呢？ ",
        "孙悟空：那么，大娘。。。。。。 ",
        "老太太：叫我~~~~~~MM！ ",
        "师徒四人全部晕倒在地。",
        "四人爬起身来，全当自己做了个梦，进到城来。 ",
        "城内繁华似锦。 ",
        "猪八戒：还好，这城里不全是老MM。哼。。。哈。。。 ",
        "孙悟空：有人在唱歌？！ ",
        "歌声：为你钟情，倾我挚情，请你珍藏这份情。。。。。。 ",
        "师徒四人异口同声：张国荣？ ",
        "唐僧拿出一张纸和一支笔：哥哥（念第二声），给我签个名吧？ ",
        "猪八戒、沙僧：还有我。。。。。。 ",
        "张国荣看了一眼唐僧：就你，也不照照，长得跟秃子罗家英似的还要签名？还有你俩，一个満脸大胡子，以为自己很性感哪？一个在自己头上套个猪头，还以为自己是猪八戒啊？ 想要签名，一边玩去吧！ 
孙悟空讨好的走过来：哥哥，您是不是在女儿国开个唱啊，也不登个广告什么的，我们四个都是您的歌迷，也好早点来捧您的场啊。 ",
        "张国荣：谁开个唱啊？ ",
        "孙悟空：那您怎么到。。。。。。 ",
        "张国荣：你们没看出来？ ",
        "师徒四人：什么？ ",
        "张国荣娇娇的转了个圈：我也是个MM么？ ",
        "唐僧跟猪八戒双双晕倒在地，孙悟空跟沙僧又想吐，突然看见那老太太正瞪着个小眼睛瞧着他们，只好拼命忍住。 ",
        "张国荣：哼。。。不解风情！ ",
        "沙僧终于没忍住，一口又吐了出来。 ",
        "老太太：你。。。。。。 ",
        "沙僧：我懂！你等等先！给我点时间，我吐啊吐啊，慢慢就习惯了。。。。。。哇。。。。。。 ",
        "老太太：这次得罚10两！ ",
        "沙僧：为什么？呕。。。。。。 ",
        "老太太：再吐就是15两了。 ",
        "沙僧只好拼命忍住，无奈身上又没那么多银子，只好转向唐僧：师父，能不能先借几两银子顶顶先？ ",
        "唐僧：KAO！又借？上回借我2两5钱外加3铜板还没还呢！门都没！ ",
        "沙僧无奈转向孙悟空：大师兄。。。。。。 ",
        "孙悟空：我。。。。。。我还一屁股债呢。上回到“丽春院”吃白食你们三全尿遁了，就留我一个，结果被人扁得跟个猴子似的。。。。。。 ",
        "猪八戒：你本来就是个猴子啊？ ",
        "孙悟空：是。。。。。。啊？！ ",
        "猪八戒：沙师弟，他们不借，我借给你，谁叫你以后得背着我上西天呢？来，这是10两！ ",
        "沙僧泪光涟涟望着猪八戒：英雄！ ",
        "猪八戒：不过。。。。。。你得给我立个字据，如果这个月没还，下个月就变12两了，这叫板上钉。。。如果再下个月没还，那就得还我18两，这叫板上钉上钉，如果再没还，那就得板上钉上钉再加钉，就得30两了。。。。。。 ",
        "沙僧：我KAO！你这不是高利贷吗？上回你借给大师兄怎么没听你这么说？ 
猪八戒：因为论智慧呢，我就比他高那么一点点，但是论武功呢，他就要比我高那么一点点。而我论智慧和武功呢，比你都要高那么一点点，我不欺负你欺负谁啊？ ",
        "沙僧：KAO！ ",
        "猪八戒：KAO什么KAO？你要不要啊！ ",
        "沙僧含泪接过10两纹银，交给老太太，惨呼：天妒英才！大。。。MM，你老看见了，我这可是砸锅卖铁了啊，您老能不能给打个折？ ",
        "老太太：瞧你怪可怜的，得，这次少收你两铜板吧！ ",
        "沙僧：!$#@$ 
待老太太找回两铜板，四人继续前行，并四处向路边的MM打听女儿国国王所在府邸。于是一路行来，不免腹中饥饿。 ",
        "猪八戒从怀中掏出三馒头边吃边哼叽：吃。。。还好，昨个还剩三馒头。师父，给您一个。 ",
        "唐僧：一提到这个吃~~~~~~~~~字。。。。。。 ",
        "猪八戒：就很兴奋是不是？ ",
        "唐僧：还是八戒疼我！ ",
        "猪八戒：那是，一日为师终身为父。 ",
        "沙僧看着，摸摸口袋又瞧瞧孙悟空，见他也是一般无奈：二哥，能不能。。。。。。 ",
        "猪八戒：门都没！ ",
        "孙悟空：有没有我的份？ ",
        "猪八戒：你想要啊？你想要说清楚不就行了吗？你想要的话我会给你的，你想要我当然不会不给你啦！不可能你说要我不给你，你说不要我却偏要给你，大家讲道理嘛！现在我数三下，你要说清楚你要不要…… ",
        "孙悟空：我KAO！你不要逼我！ ",
        "沙僧：是啊，不给我就算了，大师兄也不给？你也太~~~~~~过份了！ ",
        "猪八戒有些恐惧的看着孙悟空：我~~~我不给又怎么样了，难道你要扮我吃老虎不成？ ",
        "孙悟空：哼哼。。。。。。是你逼我的。来，沙师弟。。。。。。 ",
        "沙僧拿出一支擀面杖：收到！ ",
        "猪八戒吓得捂住脸不敢看，忽听得 
“咣~~~~~~咣~~~~~~~” ",
        "沙僧：瞧一瞧啦看一看啦啊，所谓是在家靠父母出外靠朋友了啊，各位乡亲父老兄弟姐妹叔叔阿姨了啊，大家有钱的捧个钱场没钱的捧个人场啊，咱兄弟初来乍到的也不会啥的啊，来，大师兄给大伙翻个跟斗！ 
“咣~~~~~~咣~~~~~~~” 
猪八戒、唐僧顿时晕倒在地。 
。。。。。。",
        "孙悟空：哈。。。。。。不错，今天收入不错，来，沙师弟，这12两银子给你，还给那只猪你还能留2两呢！走！咱俩搓一顿去。 ",
        "沙僧：多谢师兄！。。。。。。不知师兄今日为何如此慷慨？ ",
        "孙悟空：不瞒你说，你那本《玉蒲团》是否可以借给我参观参观？ ",
        "沙僧：你想要啊？你想要说清楚不就行了吗？你想要的话我会给你的，你想要我当然不会不给你啦！不可能你说要我不给你，你说不要我却偏要给你，大家讲道理嘛！现在我数三下，你要说清楚你要不要…… 
孙悟空一拳把沙僧打翻在地：又来！？你他妈的少跟我叽叽歪歪啰里啰嗦，我不发火你当我病猴啊，跟你说老子出来混的时候你还是个小屁孩呢！ 
沙僧眼圈一红：你要就要嘛，干嘛还打我？我又不是不给你，你想要的话，我一定会给你的，大家讲道理嘛。。。。。。 ",
        "孙悟空：STOP！还来。。。。。。我插。。。。。。我再插。。。。。。 
孙悟空眼圈一红跪倒在地：师父。。。。。。英雄！求你了，把这个金箍给他带吧，我真受不了他了。。。。啊。。。。 ",
        "唐僧：我本来是想给他来着，唉，可是那个金刚圈尺寸太差，前重后轻左宽右窄，他带上之后很不舒服，整晚失眠，会连累我嘛！说起那个金刚圈，去年我在陈家村认识了一位铁匠，他手工精美、价钱又公道、童叟无欺，干脆我下次再定做一个吧！ ",
        "孙悟空：#@!#~@ ",
        "师徒四人终于来到女儿国的王宫。 ",
        "唐僧：KAO！排场真大，你们看这里的装潢设计一定用了3DMAX加PHOTOSHOP，简直是COOL毙了！ ",
        "猪八戒：是啊，这里真是太棒了，比俺高老庄还要豪华！ ",
        "孙悟空：说你是只猪你还真是只猪，人家这是皇宫，你们高老庄打实了算最多也就能算个富农，你还以为你是李世民他们家亲戚啊？透豆！ ",
        "沙僧：大师兄，别跟他一般见识，瞧他长得那样，猪头猪脑的哪能跟您猴一样的精明呢？ ",
        "孙悟空：那是！ 
。。。。。。 ",
        "女儿国王：各位就是从东土大唐而来去西天取经的大师么？ ",
        "猪八戒小声对唐僧说：我KAO！这MM长得真是标致。（口水滴哒的特写） ",
        "唐僧：是啊，你看她天使面容,魔鬼身材,要咪咪有咪咪,要PP有PP,该大的地方大,该小的地方小,该凸的地方凸,该凹的地方凹。。。。。。真是樱桃小嘴一点点，杨柳细腰赛皮管，燕语莺声啊。。。。。。（鼻血一滴一滴往下流） ",
        "孙悟空一抺鼻血：我KAO！洋妞嘛，我最讨厌了。。。。。。 ",
        "沙僧鼻血长流：我觉得还可以。。。。。。 ",
        "猪八戒：我KAO！她在挖鼻孔耶！你看。。。。。。她伸出纤纤玉手点出中。。。啊对不起是小手指，轻轻的挖啊挖。。。。。。 ",
        "女儿国王：好~~~~~爽！ ",
        "孙悟空：哇~~~~~~，好大的一坨！ ",
        "沙僧：唉~~~~~~没想到，她挖鼻孔的姿势都这么美！Yeah~~~~~我喜欢！我决定了，爱你一万年！ ",
        "侍女：好大胆！竟然敢对我国君无理！ ",
        "孙悟空：小MM差矣！所谓是“媱窕淑女，君子好逑”，又谓“床前明月光，疑是地上霜，举头望明月，低头思姑娘”。。。。。。好诗好诗。。。。。。 ",
        "女儿国王：啊，没想到师父竟有如此才华，真让小女子吃惊。。。。。。不瞒众位，其实小女子在女儿国二十三年了，二~~~十~~~三~~~年了！对不起失态了。。。。。。我一直都想找一个如意郞君，可是这里全都是女人，来了一个张国荣没想到还是个玻璃！。。。。。。所以，我想从各位之中选出一位。。。。。。 
话音刚落。 ",
        "猪八戒突然伸长手臂高喊：我~~~~~~~我~~~~~~~~！ ",
        "孙悟空一拳打翻了猪八戒：你他妈滚一边，磕瓜子磕出个臭虫来，你他妈算老几？ ",
        "沙僧：是啊，你小子在高老庄不是还有个高秀英么，再说月亮上不是还有个嫦娥么？ ",
        "猪八戒（委屈的）：感情破裂了！ ",
        "唐僧叹了口气：唉。。。。。。徒弟们哪，你们也太不争气了，象你们这样的男子汉，虽说长得损点，但是你们至少还是有一些本领的嘛，真是的！。。。。。。大~~~~丈夫何患无妻，天涯何处无芳草。。。。。。可是，你们的师父~~~~~~我。。。。。。这次，你们这次成全成全我。。。。。。 
（师徒四人争执不休） 
。。。。。。 ",
        "女儿国王：各位各位，你们也别争了，不如这样吧，大家不如各展本领，我今天要来个比武招亲！ ",
        "师徒四人：行！ 
。。。。。。 ",
        "女儿国王：为了这次比试的公正性，我们今天特意请来了一位嘉宾来当作裁判，他就是~~~~~~~江湖上人称“人见人爱，迷死人不赔命吃不了兜着走”的张国荣！ 
张国荣：很感谢大家对我支持，在这里我首先要谢谢国王陛下，还要谢谢我的家人，以及在场的各位，然后我还要谢谢一直在我背后支持我的唐先生。。。。。。Honey!I love you,yeah,yeah,yeah!众人：倒孙悟空：你有没有搞~~~~~错！你是来当裁判的，你以为是在红堪体育馆啊？ 
张国荣；Sorry,Sorry!我之所以要讲这么多，完全是因为。。。。。。其实我是一个演员。。。。。。 
（无数只西红柿、臭鸡蛋掷了过去） 
。。。。。。 ",
        "张国荣：好了，下面公布比赛的项目。 ",
        "众人凝神静听。 ",
        "张国荣：为了比赛的观赏性、娱乐性以及本着公平竞赛的原则，比赛分两个阶段。由于跟电视台的磋商问题，我们直接采用淘汰赛制。好的，比赛的题目是~~~~~~~扮酷！ 
话音刚落，大厅内突然出现一阵烟雾。 ",
        "女儿国王：哇~~~~~~未来战士！ ",
        "猪八戒：不错！其实，我就是未来战士，阿诺。猪~~~~~华！酷吧？咦。。。谁在捅我屁股？ 
孙悟空一擀杖打在猪八戒头上：酷你妈个头啦，瞧你那副德性：一支雪茄插在鼻子里嘴里咬着副墨镜两腿之间还夹着一把AK47。。。。。。 ",
        "猪八戒哭道：大师兄，不是你教我耍酷要有雪茄、墨镜还有枪么？ ",
        "孙悟空：KAO！我有教你这么搭配么？ ",
        "猪八戒扑到孙悟空怀里，抚摸着孙悟空的胸脯，嚎啕大哭：师兄，我错了。。。。。。我不该把把雪茄插在鼻子里，不该插在鼻子里。。。。。。55555",
        "孙悟空轻轻拍拍猪八戒的头，抺一把眼泪：好了啦，别这样了，以后别这样就好了啦，来，擦把眼泪，让大伙看见多不好意思啊？ ",
        "猪八戒：哦。。。。。。有够衰的，这下没搞头了，我退出。 ",
        "张国荣：好的第一个参赛者退出，NOW，The next one!沙僧：看我的！ ",
        "一阵烟雾过后。 ",
        "众人：哇~~~~~~唐伯虎耶！ ",
        "沙僧手拿一把折扇唱：求神那个求神，诚心祈求那个灵神（用粤语）。。。。。。 ",
        "女儿国王：STOP！扮什么不好你偏要扮唐伯虎？你一大把胡子剃得光光的，不想当和尚哪道你想状元哪？ ",
        "沙僧：我有想过啊。。。。。。 ",
        "女儿国王：想你妈个头啦，你好好的一个和尚不做还想当状元，我跟你说，好好做你和尚这份很有前途的职业吧！ ",
        "沙僧：哦知道了。。。。。。 ",
        "张国荣：那么沙僧也出局了。下面会是谁呢？请~~~~~~~看，下面出场的是~~~~~~~~ ",
        "大白胖子：自从我用了这牙膏，嘿，牙好胃口就好，吃嘛嘛香，您问这什么牌子？您瞅准啰，蓝天六不治。。。。。。 ",
        "歌声：回头便知，我心只有你。。。。。。 ",
        "刘德华：我为什么会有这么动人的歌声？这全是因为我经常吃“WC”牌梨膏糖。“WC”牌梨膏糖是您在家休闲，外出旅游，访亲送友之必备佳品。。。。。。 ",
        "张国荣：各位，对不起，刚刚是广告时间。下面我们接着进入比赛。。。。。。现在只剩下两位参赛者了，到底谁能得到我们国王陛下的美人归呢，是唐僧还是孙悟空？大家拭目以待。 
唐僧双手合什：贫僧并不会扮酷，只是在下想让大家看看我的真面目。 
话音刚落，唐僧宽大的袈裟突然裂成碎片，露出铁塔般结实的肌肉。 
唐僧狞笑：其实我就是江湖上人称“打不死的小神童金刚不坏的魔鬼肌肉人”！你们看，我左青龙，右边还是青龙，我上上下下左左右右全是青龙。怎么样，恐怖吧。。。。。。 ",
        "众人皆翻倒。 ",
        "张国荣扑进唐僧的怀里，抚摸着唐僧结实的肌肉：哇~~~~~~~好性~~~~~~感哪！我喜欢！ ",
        "大厅里吐成一片。 ",
        "孙悟空：没想到，师父你居然就是“魔鬼肌肉人”！作为你的徒弟。。。我实在是偑服。 ",
        "唐僧：怎么样，怕吧！ ",
        "孙悟空：徒弟甘拜下风！ ",
        "唐僧：那么。。。。。。 ",
        "孙悟空：不用比了，弟子退出。 ",
        "女儿国王：这场比试瞎子也能看出来是谁胜出了，那么我的如意郞君便是。。。。。。 ",
        "唐僧：慢着，我也退出！ ",
        "女儿国王：给我个理由先！拜托~~~~~！ ",
        "唐僧：需要吗？ ",
        "女儿国王：不需要吗？ ",
        "唐僧：需要吗？ ",
        "女儿国王：不需要吗？ ",
        "唐僧：唉。。。。。。我只是跟你随便聊聊，千万不要当真。。。。。。需要吗？ ",
        "女儿国王：一定要！ ",
        "唐僧：既然陛下一定要。那么我就告诉你实情。其实我并不想当你的如意郎君，我只是想证明给大家看，我老唐才是这四个人中的老大！他们三都得听我的，无论比什么我都要强过这哥三！ ",
        "女儿国王：你。。。。。。 ",
        "唐僧：你什么你，你再敢叽叽歪歪当心我扁你！徒弟们，走！ ",
        "（歌声响起“你挑着担，你还牵着马背着个猪八。。。。。。”） ",
        "若干年后。",
        "女儿国王：曾经有一份真诚的爱情摆在他的面前，但是他没有珍惜，等到了失去的时候才后悔莫及，尘世间最痛苦的事莫过于此。如果上天可以给他一个机会再来一次的话，我想他还是不会答应我。如果非要把这份绝情加上一个期限，我想会是一万年！ ",
        "",
        "",
        "　　（完） ",
});

void create()
{
        seteuid(getuid());
}

mixed query_story_message(int step)
{
        return step < sizeof(story) ? story[step] : 0;
}
