
   string *strs=({
        "\n\n                   "YEL"´ó¡¡¡¡»°¡¡¡¡Î÷¡¡¡¡ÓÎ\n"NOR,
        "¹Û  Òô£ºËïÎò¿Õ£¬ÄãÕâ¸öÐóÉü£¬Äã±¾À´´ðÓ¦ÈçÀ´·ð×æ»¤ËÍÄãÊ¦¸µÌÆÈý²Ø\n"
        "        È¥È¡Î÷¾­£¬Äã¾ÓÈ»¸úÅ£Ä§Íõ´®Í¨ÆðÀ´Òª³ÔÄãÊ¦¸µ£¬ÄãÖª²»ÖªµÀ\n"
        "        Äã·¸ÁËÃÖÌì´ó×ï£¿\n",
        "ËïÎò¿Õ£ºÉÙÂÞàÂ£¡Äã×·ÁËÎÒÈýÌìÈýÒ¹£¬ÒòÎªÄãÊÇÅ®ÈËÎÒ²Å²»É±Äã£¬²»Òª\n"
        "        ÒÔÎªÎÒÅÂÁËÄãÁË£¡\n",
        "ÌÆ  É®£ºÎò¿Õ£¬ÄãÔõÃ´¿ÉÒÔÕâÑù¸ú¹ÛÒô½ã½ã½²»°ÄØ£¿\n",
        "Îò  ¿Õ£º»©£¡²»Òª³³£¡\n",
        "ÌÆ  É®£ºÄãÓÖÔÚÏÅÎÒ£¡\n",
        "¹Û  Òô£ºÄã²»ÊÇÅÂÎÒÓÖÎªÊ²Ã´Òª´òÉË×ÏÏ¼ÏÉ×ÓÇÀ×ßËýµÄÔÂ¹â±¦ºÐ£¬Äã²»\n"
        "        ¾ÍÊÇÏë¶ã¿ªÎÒÂð£¿\n",
        "Îò  ¿Õ£º¼ÈÈ»¶ã²»ÁËÄÇÀÏËï¾Í¸úÄã¾øÒ»ËÀÕ½£¡\n",
        "\n      (Îò¿Õ½«ÔÂ¹â±¦ºÐËæÊÖÒ»Å×£¬ÕýºÃÔÒÔÚÌÆÉ®Í·ÉÏ¡£)\n\n",
        "ÌÆ  É®£ºÓÖ¸ÉÊ²Ã´£¿\n",
        "\n      (Á©ÈËÕýÒª¶¯ÊÖ£¬Í»È»¡­¡­)\n\n",
        "ÌÆ  É®£ºÎ¹Î¹Î¹£¡´ó¼Ò²»ÒªÉúÆø£¬ÉúÆø»á·¸ÁËàÁ½äµÄ£¡Îò¿ÕÄãÒ²Ì«µ÷Æ¤\n"
        "        ÁË£¬ÎÒ¸úÄãËµ¹ý½ÐÄã²»ÒªÂÒÈÓ¶«Î÷£¬ÄãÔõÃ´ÓÖ¡­Äã¿´ÎÒ»¹Ã»Ëµ\n"
        "        ÍêÄãÓÖ°Ñ¹÷×Ó¸øÈÓµôÁË£¡ÔÂ¹â±¦ºÐÊÇ±¦Îï£¬Äã°ÑËûÈÓµô»áÎÛÈ¾\n"
        "        »·¾³£¬ÒªÊÇÔÒµ½Ð¡ÅóÓÑÔõÃ´°ì£¿¾ÍËãÔÒ²»µ½Ð¡ÅóÓÑÔÒµ½ÄÇÐ©»¨\n"
        "        »¨²Ý²ÝÒ²ÊÇ²»¶ÔµÄ£¡\n",
        "\n      (Îò¿ÕÒ»°Ñ×¥×¡ÌÆÉ®ÊÖÖÐµÄÔÂ¹â±¦ºÐ)\n\n",
        "ÌÆ  É®£º¸ÉÊ²Ã´£¿\n",
        "Îò  ¿Õ£º·ÅÊÖ£¡\n",
        "ÌÆ  É®£ºÄãÏëÒª°¡£¿Îò¿Õ£¬ÄãÒªÊÇÏëÒªµÄ»°Äã¾ÍËµ»°Âï£¬Äã²»ËµÎÒÔõÃ´\n"
        "        ÖªµÀÄãÏëÒªÄØ£¬ËäÈ»ÄãºÜÓÐ³ÏÒâµØ¿´×ÅÎÒ£¬¿ÉÊÇÄã»¹ÊÇÒª¸úÎÒ\n"
        "        ËµÄãÏëÒªµÄ¡£ÄãÕæµÄÏëÒªÂð£¿ÄÇÄã¾ÍÄÃÈ¥°É£¡Äã²»ÊÇÕæµÄÏëÒª\n"
        "        °É£¿ÄÑµÀÄãÕæµÄÏëÒªÂð£¿¡­¡­\n",
        "Îò  ¿Õ£ºÎÒKao£¡\n"
        "\n           (Îò¿ÕÒ»È­½«ÌÆÉ®´òµ¹¡£)\n\n",
        "¹Û  Òô£º°¡£¿ËïÎò¿Õ£¡\n"
        "Îò  ¿Õ£º´ó¼Ò¿´µ½À²£¿Õâ¸ö¼Ò»ïÃ»ÊÂ¾Í³¤Æª´óÂÛÆÅÆÅÂèÂèß´ß´ÍáÍá£¬¾Í\n"
        "        ºÃÏóÕûÌìÓÐÒ»Ö»²ÔÓ¬£¬ÎË¡­¡­¶Ô²»Æð£¬²»ÊÇÒ»Ö»£¬ÊÇÒ»¶Ñ²ÔÓ¬\n"
       "\n       (Îò¿Õµ¹µØ·­¹ö£¬Òì³£Í´¿à¡£)\n\n",
       "Îò  ¿Õ£ºËùÒÔÄØÎÒ¾Í×¥×¡²ÔÓ¬¼·ÆÆËüµÄ¶ÇÆ¤°ÑËüµÄ³¦×Ó³¶³öÀ´ÔÙÓÃËüµÄ\n"
       "        ³¦×ÓÀÕ×¡ËûµÄ²±×ÓÓÃÁ¦Ò»À­£¬ºÇ£­£­£¡ÕûÌõÉàÍ·¶¼Éì³öÀ´À²£¡\n"
       "        ÎÒÔÙÊÖÆðµ¶Âä»©£­£­£¡Õû¸öÊÀ½çÇå¾»ÁË¡£ÏÖÔÚ´ó¼ÒÃ÷°×£¬ÎªÊ²\n"
       "        Ã´ÎÒÒªÉ±Ëû£¡\n",
       "¹Û  Òô£ººß£¡Îò¿Õ£¬ÄãÖî¶à½è¿Ú£¬Äã¸ù±¾¾Í²»ÏëÈ¥È¡Î÷¾­£¡\n",
       "Îò  ¿Õ£ºËµÄÇÃ´¶à¸ÉÊ²Ã´£¬´òÑ½£¡\n",
       "\n       (Á©ÈËÒ»·¬¶··¨£¬Îò¿Õ±»¹ÛÒô½µ·þÊÕÈë¸ÊÂ¶Æ¿¡£)\n\n"
       "¹Û  Òô£º½ñÌìÎÒÒªÌæÌìÐÐµÀ£¡\n",
       "ÌÆ  É®£ºÎ¹Î¹Î¹£¡Í½µÜÓÐ´í×öÊ¦¸µµÄÒ²ÓÐÔðÈÎ£¬Çó½ã½ã·ÅËûÒ»ÌõÉúÂ·°É£¡\n",
       "¹Û  Òô£ºÎÒ²»ÏûÃðËûÎÒÃ»·¨ÏòÓñ»Ê´óµÛ½»´ú£¡\n",
       "ÌÆ  É®£ºÇë½ã½ãÏòÓñ»Ê´óµÛËµÒ»Éù£¬Æ¶É®Ô¸ÒâÒ»ÃüÅâÒ»Ãü£¡(ºÏÊ®×øµØ£¬\n"
       "        ½«·¨ÕÈÏò¿ÕÖÐÒ»Å×)à«ß¼°¢ÃÖÍÓ·ð£¡\n"
       "\n        (·¨ÕÈ½«ÌÆÉ®ÔÒËÀ¡£)\n\n",
        });

string *str1=({
"\n\n                   [1;32mÎò¿ÕÈý´ò°×¹Ç¾«[m                \n",

        "»°ËµÕâÒ»ÈÕ£¬ÌÆÉ®Ê¦Í½ËÄÈËÀ´µ½ÁËÒ»×ù´óÉ½½ÅÏÂ¡£\n" 
        "ÌÆÉ®£ºÍ½¶ù£¬ÕâÀïÊÇ¸öÊ²Ã´È¥´¦£¿ÕæÊÇÌ«~~~~~ºÃ¿´À²£¡\n",
        "Îò¿Õ£ºÊ¦¸µ£¬Àë¿ª¶«ÍÁ´óÌÆÒÑ¾­ºÃ¼¸ÄêÁË£¬ÄãÔõÃ´»¹ÊÇÕâ¸öÑù×Ó£¿\n"
        "      Ò»×ùÊ¯Í·É½¶øÒÑ£¬ÓÐÊ²Ã´ºÃ¿´µÄ£¿ËµÄãÊÇÍÁ±î£¬ÓÖÅÂ¹ÛÒô½ã\n"
        "      ½ãÂîÎÒ£¬ÔÚÕâ×ùÉ½ÉÏËæ±ãÕÒÒ»¿éÊ¯Í·¶¼±ÈÄãÓÐ¼ûÊ¶£¡ÏñÄãÕâ\n"
        "      ÑùÔõÃ´ÕÖµÄ×¡´ó¼Ò£¿ÎÒÃÇºÃÀµÒ²»áÒ»µã·¨Êõ£¬¾ÍÁ¬ÄãÆïµÄÄÇ\n"
        "      Æ¥ÂíÒ²Ò»ÏÂ×Ó¾Í°ÑÄãÌß·­ÁË£¬Äã³ýÁËÃ»ÍêÃ»ÁËµÄ¸øÎÒÃÇÕÒÂé\n"
        "      ·³£¬°ÝÍÐÄãÒ²Ñ§Ò»µã±ðµÄ±¾ÊÂ£¡ \n",
        "ÌÆÉ®£º¿¿£¡ÎÒÖ»²»¹ýÊÇËæ±ãÊæÁËÒ»ÏÂÇé£¬Äã¾ÍÕâÃ´ÆÅÆÅÂèÂè¡¢ßóßó\n"
        "      ÍáÍá¡¢ÂÞÀïÂÞËô£¬Äã»¹Ïë²»Ïë»ìÁË£¿ \n",
        "É³É®£ººÃÁËºÃÁË£¬´ó¼Ò¶¼ÊÇ³öÀ´¸ø¹ÛÒôÈçÀ´´ò¹¤µÄ£¬ºÎ±ØÄØ£¿\n",
        "ÌÆÉ®£ºÎÒºÍÄã´óÊ¦ÐÖËµ»°Ê²Ã´Ê±ºòÂÖµ½Äã²å×ìÁË£¿ÎªÁË°âÄãÕâ\n"
        "      ¸öÃ«²¡£¬ÎÒÒÑ¾­°ÑÄã´óÊ¦ÐÖµÄ½ð¹¿´÷ÔÚÁËÄãÍ·ÉÏ£¬ÄãÓÖ\n"
        "       À´£¿\n",
        "É³É®£ºok£¡ÎÒ±Õ×ìÏÈ£¡\n",
        "ÌÆÉ®£º°Ë½ä£¬ÎªÊ¦µÄÓÖ¸ÃËµËµÄãÁË¡£ËäÈ»Äã×î½ü¼õ·ÊÓÐÐ©³ÉÐ§£¬\n"
        "      ËäÈ»É³É®²»Ï²»¶ºÍ±ðÈËÕù±ç£¬¿ÉÄã¾Í¿´ÔÚËû¼çÉÏÌô×ÅÐÐ\n"
        "      ÀîµÄ·ÝÉÏ¡­¡­Äã¾Í±ðÕâÑùÁË¡£\n",
        "°Ë½ä£ºÎÒÕâÒ²ÊÇÎªÁË´ó¼ÒºÃ°¡£¡ÎÒÀÏÖíÒ»×ßÂ·¾ÍÈÝÒ×¶ö£¬¾ÍÃâ\n"
        "      ²»ÁËÈÃ´ó¼ÒÈ¥»¯Õ«£¬¾ÍÃâ²»ÁËµ¢ÎóÁËÈ¡¾­µÄÊ±ÈÕ¡£\n",
        "ÌÆÉ®£ºÄÇÊÇÎÒ´í¹ÖÄãÁË£¬Äã¾Í¼ÌÐøÔÚÄãÊ¦µÜ²±×ÓÉÏÆï×Å°É¡£\n",
        "É³É®£º#£¤@$^ÌÆÉ®£ºÎò¿Õ£¬ÈÃËûÕâÃ´Ò»Ëµ£¬ÎÒ»¹ÕæÓÐÐ©¶ö\n"
        "      ÁË£¬¾ÍÀÍ·³Äã×ßÒ»ÌË°É£¡\n",
        "Îò¿Õ£ºÓÖÊÇÎÒ£¿ÂÖÒ²ÂÖµ½ÄãÈ¥ÁË°É£¿\n"
        "ÌÆÉ®£º´ÓÀíÂÛÉÏÀ´½²£¬ÎÒÓ¦¸ÃÈ¥»¯Õ«µÄ£¬¿ÉÈË¼ÒÕâÁ½Ìì¡­\n"
        "      ¡­²»Ì«·½±ã¡­¡­\n"
        "\n¡¡¡¡[1;35m£¨¼¯ÌåÔÎµ¹£©[m\n",
        "Îò¿Õ£ººÃ£¬ÎÒÈ¥£¡\n",
        "°Ë½ä£ºµÈÒ»µÈ£¬ÍòÒ»Ò»»á¶ùÀ´¸öÊ²Ã´ÈË°¡Ñý°¡µÄ£¬À´½ÙÉ«\n"
        "      ÔõÃ´°ì£¿\n",
        "É³É®£º°ÝÍÐ£¬Äã¿´¿´ÎÒÃÇÒ»¸ö¸ö¹âÍ·µÄ¹âÍ·£¬´óºú×ÓµÄ´ó\n"
        "      ºú×Ó£¬Ê²Ã´ÈËÑý¸ÒÀ´½ÙÎÒÃÇ°¡£¿\n",
        "°Ë½ä£º±äÌ¬£¡\n",
        "É³É®£º°¡£¿ÕâÒ²±»Äã¿´³öÀ´ÁË£¿Ã»´í£¬ÎÒµÄºú×ÓÊÇÌùÉÏµÄ\n"
        "      £¬ÎÒ¾õµÃ×÷ÎªÒ»¸öÄÐÈËÂï¡­¡­\n",
        "°Ë½ä£ºstop£¡ÎÒÊÇËµ±äÌ¬»áÀ´½ÙÎÒÃÇ°¡£¡\n",
        "ÌÆÉ®£ºÊÇ°¡£¡Îò¿Õ£¬Õâ»Ä½¼Ò°ÍâµÄ£¬ÄÑÃâ»áÓÐÊ²Ã´¶«¶«³ö\n"
        "      À´£¬Äã¿´¡­¡­\n",
        "Îò¿Õ£ºÕæÊÇÂé·³ÄÄ£¡ÔçÖªµÀÕâÑù£¬ÎÒ¾Í×Ô¼ºÈ¥È¡¾­ÁË¡£»¹\n"
        "      ºÃÎÒÔçÓÐ×¼±¸£¬¿´£¡\n"
        "£¨ÖÚÈË£©£º°¡£¡ÊÇµçÍø£¡\n",
        "Îò¿Õ£º²»´í£¡Õâ¾ÍÊÇ±£ïÚÅÆµçÍø£¬ËüºÄµçÉÙ£¬Ò×²Ù×÷£¬µç\n"
        "      Ñ¹¿Éµ÷£¬°²È«ÐÔ¸ß£¬¸üÓÐ½»Ö±Á÷Á½ÓÃµÄÐÍºÅ£¬¶ÀÓÐ\n"
        "      µÄÂ©µç±£»¤×°ÖÃ£¬ÌØ±ðÊÊºÏ¼ÒÖÐÓÐÐ¡º¢µÄ¼ÒÍ¥£¬Ëû\n"
        "      µÄ¶ÀÌØÕÛµþÉè¼Æ£¬¸ü±ãÓÚÐ¯´ø£¬ÊÇ¾Ó¼ÒÂÃÓÎ±Ø±¸Ö®\n"
        "      ¼ÑÆ·£¡¶øÇÒ²»¹óßÏ£¡´ÓÏÖÔÚ¿ªÊ¼Ö»ÒªÄú²¦´òÎÒÃÇµÄ\n"
        "      Ö±ÏúÃâ·Ñµç»°£¬ÎÒÃÇµÄ¹¤×÷ÈËÔ±»áÔÚ24Ð¡Ê±ÄÚÎªÄú\n"
        "      Ãâ·ÑÉÏÃÅ°²×°µ÷ÊÔ£¡²¢»áËÍÄãÒ»¸ö¾«ÃÀµÄµç¶¯¶úÍÚÉ×£¡\n",
        "É³É®£º´óÊ¦ÐÖ£¬ÎÒÖªµÀÁË£¬ÎÒÓÐ´øµç³ØÒ®£¡\n",
        "Îò¿Õ£º¹Ô£¡~~~~~ÀÏËïÕâ¾ÍÈ¥Ò²£¡\n",
        "ÌÆÉ®£ºµÈÒ»µÈ£¡Îò¿Õ£¬Äã°ÑÉ³É®±³µÄË®¸×´øÉÏ£¬Õâ´ÎÄã¶à\n"
        "      »¯Ð©Õ«·¹À´£¬ÎªÊ¦µÄÓÐÐ©¶öÁË£¡\n",
        "Îò¿Õ£º¡­¡­ÁË½â£¡\n"
        "\n[1;35m¡¡¡¡£¨Óë´ËÍ¬Ê±£¬ÔÚ´ËÉ½µÄÉ½¶´Àï°×¹Ç¾«Ò»¼ÒÈý¿ÚÕýÔÚ¿´µçÊÓ£©[m\n",
        "°×°Ö°Ö£ºµçÊÓ½ÚÄ¿ÕæÊÇÃ»ÒâË¼£¬Ò»Ììµ½ÍíÒ²Ã»Ê²Ã´ºÃ¿´µÄ\n"
        "        ¡£´ÓÂò»Ø¼ÒºóÎÒ»¹Ã»¼û¹ýËû·Åµã±ðµÄ£¡\n",
        "°×¶ù×Ó£ºÔç¾Í¸æËßÄãÓ¦¸Ã×°Ò»ÌõÌìÏßµÄ£¬±¾À´¾ÍÊÇÔÚ´óÉ½\n"
        "        Àï£¬Ã»ÓÐÐÅºÅ£¬µ±È»¾ÍÖ»ÓÐÑ©»¨¿´ÁË¡£\n",
        "°×ÂèÂè£ºÒÀÎÒ¿´£¬µ½ÁËÍíÉÏËüµÄÓÃ´¦»á´óÒ»Ð©£¬Ö»Òª¹Øµô\n"
        "        ÉùÒô£¬ÔÛÃÇ¿ÉÒÔÓÃËüÀ´µ±Ì¨µÆÂï£¡\n",
        "°×¶ù×Ó£ºÐê¡­¡­ºÃÏñÓÐÉùÒôÒ®£¡\n",
        "°×ÂèÂè£º×¼ÊÇÄã°Ö°Ö´ó±ãÍêÏ´ÊÖÊ±Ã»ÓÐ¹ØºÃË®ÁúÍ·¡£\n",
        "°×°Ö°Ö£º¿¿£¡ÎÒÒÑ¾­Èý¸ö¶àÔÂÃ»ÓÐ³ÔÈËÁË£¬ÄÄÀ´µÄ´ó±ã°¡\n"
        "        £¿ËµÊµÔÚµÄ£¬ÏÖÔÚÒªÊÇÓÐ´ó±ãÎÒ¶¼Ïë³ÔÁË£¡\n",
        "°×¶ù×Ó£ºÁ½¸ö°×³Õ£¬¿´±¨Ö½ÁËÃ´£¿¡¶Î÷ÓÎÈÕ±¨¡·ÉÏËµÌÆÉ®\n"
        "        ¾ÍÒªÀ´ÁË£¡³ÔÁËËûµÄÈâ£¬²»µ«¿ÉÒÔÑÓÄêÒæÊÙ£¬³¤\n"
        "        Éú²»ÀÏ£¬»¹¿ÉÒÔÖ¹¿È»¯Ìµ¡¢ÇåÑÊÈóºí£¬ÉÏÌì°²ÅÅ\n"
        "        µÄ»ú»á£¬ÎÒÃÇÃ»ÓÐÀíÓÉ´í¹ýµÄ£¡\n",
        "°×°Ö°Ö£º½ðÉ¤×Óºí±¦£¿¿ì³öÈ¥¿´¿´ÏÈ£¡\n",
        "°×¶ù×Ó£º²»¹ýÌýËµÌÆÉ®ÊÖÏÂÓÐ¸öºÚÉç»áÐÔÖÊµÄÉçÍÅ×éÖ¯£¬\n"
        "        ÎªÊ×µÄËïÎò¿ÕÊÇÎå°ÙÄêÇ°´óÄÖ·ïÀ´Â¥µÄÆëÌì´óÊ¥£¡\n",
        "°×ÂèÂè£ºÆëÌì´óÊ¥£¿ÊÇÐÇ³ÛÐéÄâÉçÇøÀïµÄÄÇ¸öÃ´£¿ÎÒÖªµÀµÄ¡£\n",
        "°×¶ù×Ó£ºÄÇ¸öÊÇ¼ÙµÄÀ²£¬ÄãÔÙÂÒ²å×ìÐ¡ÐÄÎÒ²å~~~~~~~~~±¬\n"
        "        ÄãµÄÑÛ¾¦£¡ÚÀ£¡ÕæÊÇÃ»°ì·¨£¬ÄãÃÇÏÈ°ÑË®ÉÕ¿ª£¬ÎÒ\n"
        "        È¥¿´¿´ÏÈ£¡\n",
        "°×°Ö°Ö£ºÐ¡ÐÄ°¡£¡¶ù×Ó£¡\n"
        "\n     £¨°×¶ù×ÓÀ´µ½ÁËÌÆÉ®ÐÝÏ¢µÄµØ·½¡­¡­£©\n",
        "°×¶ù×Ó£ºÊ¦¸µÃÇºÃ£¡\n",
        "ÌÆÉ®£º  Ð¡ÅóÓÑºÃ£¬ÄãÒ»¸öÈËÔÚ¸ÉÊ²Ã´ÄØ£¿\n",
        "°×¶ù×Ó£ºÎÒ»Ø¼Ò£¬Ç°Ãæ²»Ô¶¾ÍÊÇÎÒ¼ÒÁË£¬ÎÒ°Ö°ÖÂèÂè×öºÃÁË\n"
        "        ·¹²ËµÈÎÒ»Ø¼Ò³Ô·¹ÄØ£¡\n",
        "°Ë½ä£º  Ê²Ã´£¿ÓÐ·¹²Ë£¿Ê¦¸µ£¬´óÊ¦ÐÖºÃ¾ÃÒ²²»»ØÀ´£¬¸É´àÔÛ\n"
        "        ÃÇ¸úÐ¡¼Ò»ïÒ»Æð»Ø¼ÒËãÁË¡£\n",
        "ÌÆÉ®£º  ÄãÒ²Ì«ÎÞÀñÁË£¬ÈË¼Ò¶¼Ã»ÒªÎÒÃÇÈ¥£¬ÎªÊ¦ÔõºÃÒâË¼¿ª\n"
        "         ¿Ú£¿ÄãÒ»¸öÀÏÖíÏòÈË¼ÒÐ¡ÅóÓÑÌÖ·¹£¬Äã²Ñ²»²ÑÀ¢Ñ½£¡\n",
        "°×¶ù×Ó£ºÃ»¹ØÏµ£¬ÎÒ¼ÒÒ²ÊÇÐÅ·ðµÄ£¬ÎÒ¸¸Ä¸Ò»¶¨»áºÜ¸ßÐË´ó¼Ò\n"
        "        Ò»ÆðÈ¥µÄ¡£\n",
        "ÌÆÉ®£º  Å¶£¿Äã¼Ò»¹ÓÐ±ðÈËÃ´£¿\n",
        "°×¶ù×Ó£ºÎÒ¼ÒÖ»ÓÐÎÒÃÇÈýÈË¡£\n",
        "ÌÆÉ®£º  ÕæÊÇÒ»¶Ô·òÆÞÒ»¸öÍÞ£¬¼´Àû¹úÀ´ÓÖÀû¼Ò°¡£¡É³É®£¬Äã\n"
        "        °ÑµçÍøÊÕºÃ£¬ÎÒÃÇ²»µÈÎò¿ÕÁË¡£\n"
        "\n¡¡¡¡£¨ÕâÊ±Îò¿ÕÇ¡ºÃ¸Ï»ØÀ´ÁË£©\n",
        "Îò¿Õ£º  ß¾£¡³Ô°³ÀÏËïÒ»°ô£¡\n",
        "ÌÆÉ®£º  ×¡ÊÖ£¡Äã´òÐ¡ÅóÓÑÎÒ¾Í²»ËµÄãÊ²Ã´ÁË£¬¿ÉÊÇÄãÒ²Ó¦¸Ã\n"
        "        ÃéµÃ×¼Ò»Ð©Ñ½£¿Äã²îÒ»µã¾Í´òµ½ÎÒÁË£¡\n",
        "Îò¿Õ£º  ¶Ô²»Æð£¡¶Ô²»Æð£¡ÎÒÖØÐÂ´ò¹ý¡£ß¾£¡³Ô°³ÀÏËïÒ»°ô£¡\n",
        "°×¶ù×Ó£º°¡£¡£¨µ±³¡±ÐÃü£©£¨ÐÄÏë£º¿¿£¡Ì«µ¹Ã¹ÁË£¬ËµÊ²Ã´¶ù\n"
        "        Í¯ÊÇÎ´À´µÄÖ÷ÈËÎÌ£¬ÎªÊ²Ã´ÏÈËÀµÄÊÇÎÒ£¡£©\n",
        "°Ë½ä£º  ²»µÃÁËÀ²£¡´óÊ¦ÐÖ´òËÀÈËÀ²£¡\n"
        "É³É®£º  ºß£¡ÉÙ¼û¶à¹Ö£¡\n"
        "ÌÆÉ®£º  °Ë½ä£¬Äã´óÊ¦ÐÖÒ»Â·ÉÏÒÑ¾­É±ÁËÕâÃ´¶àÉúÁé£¬Äã½Ð¸ö\n"
        "        Í·°¡£¡²»¹ýÎò¿Õ£¬Õâ´ÎÄã¿É´íÁË£¬ÎÒ¸Õ²ÅÎÊ¹ýÕâ¸öÐ¡\n"
        "        ÅóÓÑ£¬Ëû¼ÒÀïÒ»¼ÒÈý¿Ú£¬ËûÊÇ¶ÀÉú×Ó£¬²»ÊÇ¼Æ»®ÍâÉú\n"
        "        Óý£¬Äã²»Ó¦¸ÃÉ±Ëû¡£\n",
        "Îò¿Õ£ºÊ¦¸µ£¬Õâ·½Ô²°ÙÀïÄÄÀ´µÄÈË¼Ò£¿\n"
        "ÌÆÉ®£ºÒ²ÐíÊÇÂ¶ÓªµÄÄØ£¿\n"
        "Îò¿Õ£ºÂ¶ÄãÀÏÄ¸£¡\n"
        "ÌÆÉ®£ºÄã¸ÒÂîÎÒ£¡\n"
        "Îò¿Õ£ºÒª²»ÊÇ¿´ÔÚ¹ÛÒôÆÐÈøµÄ·ÝÉÏ£¬ÎÒ»¹Òª´òÄãÄØ£¡\n"
        "ÌÆÉ®£º¡ò¡ù¡ø¡÷£À£¦££¡ö¡î¡ì¡þ¡ô¡ó¡­¡­£¨½ô¹¿Öä£©\n"
        "É³É®£ºÊ¦¸µÄªÄî£¡\n"
        "ÌÆÉ®£ºSORRY£¡ÎÒÍü¼Ç½ð¹¿ÔÚÄãÍ·ÉÏÁË¡£\n"
        "Îò¿Õ£º¿´Äã»¹»áÊ²Ã´£¡\n",
        "ÌÆÉ®£ººÃ£¬I·þÁËU¡£²»ÈçÔÛÃÇ³Ô·¹ÏÈ£¡\n"
        "Îò¿Õ£ºÔçÕâÑù¶àºÃ£¡\n"
        "\n¡¡¡¡£¨É½¶´ÀïµÄÁ½¹øË®¶¼ÉÕ¸ÉÁË£¬»¹²»¼û°×¶ù×Ó»ØÀ´£©\n"
        "°×°Ö°Ö£ºÀÏÆÅ£¬¶ù×ÓÔõÃ´»¹²»»ØÀ´£¿\n"
        "°×ÂèÂè£ºÊÇ°¡£¬×¼ÊÇºÍ±±É½ºüÀê¾«¼ÒµÄÐ¡Å®º¢ÍæÈ¥ÁË£¬Äã¿É¸Ã\n"
        "        ºÃºÃ¹Ü½ÌÒ»ÏÂ¶ù×ÓÁË£¬Ã÷Äê¾Í¸ß¿¼ÁË£¬Ð¡ÐÄÔçÁµ£¡\n",
        "°×°Ö°Ö£ºÄãÉñ¾­°¡£¡Äã¼û¹ýÒ»¶Ñ°×¹ÇºÍÒ»Ö»ºüÀê½á»éµÄÃ´£¿\n"
        "        ¿Æ»ÃÐ¡Ëµ°¡£¿ÎÀË¹Àí°¡£¿ÄãÊ¡Ê¡°É¡£\n",
        "°×ÂèÂè£º¾ÍÄã¶®£¡²»ÐÐ£¬ÎÒµÃÈ¥ÕÒÕÒËû£¡\n"
        "°×°Ö°Ö£ººß£¡Å®ÈË£¡\n"
        "°×ÂèÂè£º´í£¡Ó¦¸Ã½ÐÅ®¹í£¡\n"
        " \n£¨°×ÂèÂèÕÒÀ´ÁË¡­¡­£©\n",
        "°×ÂèÂè£º¸÷Î»Ê¦¸µ£¬ÄãÃÇ¸Õ²Å¿É¿´¼ûÒ»¸öÐ¡ÄÐº¢¾­¹ýÕâÀïÃ´£¿\n"
        "ÌÆÉ®  £ºÎÒÃÇÒ²ÊÇ¸ÕÀ´µÄ£¬ÎÒÃÇÊ²Ã´Ò²Ã»¿´¼û¡£\n"
        "°Ë½ä  £ºÊÇ°¡£¡¾ÍËãÎÒÃÇ¿´¼ûÁËÒ»¸öÐ¡ÄÐº¢£¬ÎÒÃÇÒ²Ã»ÓÐÉ±ÁËËûÑ½£¡\n"
        "Îò¿Õ  £º¿¿£¡ÄãÖíÄÔ°¡£¿\n"
        "°Ë½ä  £º¶ÔÑ½£¿\n"
        "É³É®  £º¶þÊ¦ÐÖ£¬Äã¾ÍÉÙËµÁ½¾ä°É¡£\n",
        "°×ÂèÂè£ºÊ²Ã´£¿£¨Ò»ÑÛ¿´¼ûÁËµØÉÏµÄÊ¬Ìå£©ÕâÊÇË­¸ÉµÄ£¿\n",
        "ÌÆÉ®  £ºÎÒÔç¾Í¸æËß¹ýÄãÃÇÉ±ÍêÈËÒÔºóÒª´¦ÀíºÃÏÖ³¡µÄ£¬²»È»ºÜ\n"
        "        ÈÝÒ×ÈÃÈË¼Ò×¥µ½µÄ¡£Äã¿´£¬ÈÃÎÒËµÖÐÁË²»ÊÇ£¿\n",
        "Îò¿Õ  £º±ÕÉÏÄãµÄÎÚÑ»×ì£¡\n"
        "°×ÂèÂè£º°¡£¡~~~~~¶ù×Ó°¡£¬ÄãËÀµÄºÃ²Ò°¡£¡ÊÇË­É±ÁËÄãÑ½£¡\n"
        "ÌÆÉ®  £º²»ÊÇÎÒ¡£\n"
        "°Ë½ä  £º²»ÊÇÎÒ¡£\n"
        "É³É®  £º²»ÊÇÎÒ¡£\n",
        "°×ÂèÂè£ºÄÇÒ»¶¨¾ÍÊÇÄãÁË£¡ÕâÊÇÊ²Ã´ÊÀµÀ°¡£¡Á¬Âí¶¼»áÉ±ÈË°¡£¡\n"
        "°×ÁúÂí£º°ÝÍÐ£¬ÎÒÈÃÈË¼ÒÆï»¹Æï²»¹ýÀ´ÄØ£¬ÄÄÓÐÊ±¼äÉ±ÈË°¡£¿ÄÇ\n"
        "        ±ß»¹Õ¾×ÅÒ»¸öÄØ¡£\n",
        "°×ÂèÂè£ºÎÒÖªµÀ£¬Ëû²»¾ÍÊÇËïÎò¿Õ÷á£¬¿ÉÎÒ´ò²»¹ýËûÑ½£¬Äã¾Í½«\n"
        "        ¾Í×ÅÈÃÎÒËæ±ãõßÁ½½Å½â½âÆø¾ÍÐÐÁË¡£\n"
        "Îò¿Õ  £ºÐ¡ÐÄÎÒ¸æÄãÅ°´ý³èÎï£¡\n"
        "°×ÁúÂí£º¿¿£¡Äã»¹µ±ÎÒÊÇ³èÎï°¡£¡ÄãÃÇÃ¿Ìì³Ô±¥ºÈ×ãÁË£¬Ëæ±ãÕÒ\n"
        "        Ð©²ÝÀ´ºýÅªÎÒ£¬ÆäÊµÎÒÒ²ÊÇÁúÍõÈýÌ«×Ó°¡£¡Ò»Ììµ½ÍíÍÔ\n"
        "        ×ÅÕâ¸öÅÖºÍÉÐ×ßÀ´×ßÈ¥µÄ£¬ÄÇ¼ÒÊÇÕâÑù¶Ô³èÎïµÄ£¿\n",
        "Îò¿Õ  £ººÃºÃºÃ£¬ÎÒ¸æËýÅ°´ýÉüÐó×Ü¿ÉÒÔÁË°É£¿\n"
        "°×ÁúÂí£ºÕâ»¹²î²»¶à£¡\n",
        "°×ÂèÂè£ººÃÁË£¡ÄãÃÇÒ²¹ØÐÄÒ»ÏÂÎÒµÄº¢×ÓºÃ²»ºÃ£¿\n"
        "Îò¿Õ  £ºº¢×ÓËÀÁË¿ÉÒÔÔÙÉúÒ»¸ö£¬ÎÒ¿´Äã»¹ËãÓ²ÀÊ£¬ÀÏ¹«ÉíÌåÒ²²»\n"
        "        ´í°É£¿»¹²»¿ì»Ø¼ÒÔÙÉúÒ»¸ö£¿\n"
        "ÌÆÉ®  £ºÎò¿Õ£¬Äã´òËÀÈË¼ÒµÄº¢×Ó£¬ÔõÃ´»¹¿ÉÒÔÕâÑùºÍÈË¼Ò½²»°£¿\n"
        "°Ë½ä  £º¾ÍÊÇµÄ¡£\n"
        "Îò¿Õ  £ºÈ¥£¡\n",
        "ÌÆÉ®  £ºÒª²»ÕâÑù°É£¬ÕâÊÇÊ®Á½Òø×Ó£¬ÄãÄÃ»ØÈ¥°Ñ¶ù×Ó°²ÔáÁËÏÈ¡£\n"
        "°×ÂèÂè£ºÊ®Á½£¿´ò·¢Òª·¹µÄ£¿\n"
        "É³É®  £ºÊ©Ö÷£¬Ê®Á½ÒÑ¾­²»ÉÙÁË£¬ÎÒÌôÒ»ÐÇÆÚµÄµ£×Ó²ÅÒ»Á½°¡£¡\n"
        "°×ÂèÂè£ºÎÒÉú¸ö¶ù×ÓÒ²²»ÈÝÒ×£¬¸É´àÒ»¿Ú¼Û£¬¶þÊ®Á½£¡\n"
        "°Ë½ä  £ºÇÀ½Ù°¡£¿\n"
        "ÌÆÉ®  £ºÊ®¶þÁ½¡£\n"
        "°×ÂèÂè£ºÊ®¾ÅÁ½¡£\n"
        "ÌÆÉ®  £ºÊ®ËÄÁ½¡£\n"
        "°×ÂèÂè£ºÊ®°ËÁ½¡£\n"
        "ÌÆÉ®  £ºÊ®ÁùÁ½¡£\n"
        "°×ÂèÂè£º³É½»£¡\n"
        "Îò¿Õ  £ºß¾£¡³Ô°³ÀÏËïÒ»°ô£¡\n"
        "°×ÂèÂè£º°¡£¡~~~~~£¨ËÀÁË£©\n",
        "ÌÆÉ®  £ºÎò¿Õ£¬ÈË¼ÒÓÖÃ»ÓÐËµÒª³ÔÎÒ£¬ÄãÔõÃ´ÓÖ¿ªÉ±½äÁË£¿\n"
        "Îò¿Õ  £ºÎÒ×îÌÖÑá¸úÈË¼ÒÌÖ¼Û»¹¼ÛµÄÅ®ÈË£¬·´ÕýÒ²ÊÇ¸öÑý¹Ö\n"
        "        £¬ÓÖÊ¡ÁËÊ®ÁùÁ½Òø×Ó£¬ºÎÀÖ¶ø²»ÎªÄØ£¿\n"
        "ÌÆÉ®  £ºßí£¡ËµµÄÓÐÐ©µÀÀí£¬¿ì×ß°É£¬±ðÍüÁË°ÑÇ®ÄÃ»ØÀ´£¡\n"
        "\n [1;35m£¨ÖÕÓÚ°×°Ö°ÖÒ²µÈ²»¼°ÁË£¬ËûÒ»Â·×·ÁË¹ýÀ´¡­¡­£©[m\n",
        "°×°Ö°Ö£ºÄãÃÇ¾ÍÊÇÈ¥Î÷ÌìÈ¡¾­µÄºÍÉÐ£¿\n"
        "ÌÆÉ®  £º²»´í£¬ÎÒ¾ÍÊÇ¶«ÍÁ´óÌÆÎ÷È¥È¡¾­µÄÉ®ÈË£¬¼ò³ÆÌÆÉ®£¡\n"
        "°×°Ö°Ö£ºÄãÃÇ¼¸¸öºÍÉÐºÃ´óµÄµ¨×Ó£¡¾¹¸ÒÉËÎÒÆÞ¶ùÁ½ÌõÐÔÃü£¡\n"
        "ÌÆÉ®  £º¿¿£¡Ò»¼Ò×Ó¶¼À´ÁË£¬ÎÒÕæ¸ã²»¶®£¬ÎÒ¾ÍÊÇÒ»¸öºÍÉÐ\n"
        "        ¶øÒÑ£¬³ÔÁËÎÒµÄÈâÔõÃ´»á³¤Éú²»ÀÏÄØ£¿¼´±ãÊÇÕâÑù£¬\n"
        "        ÕâÒ»Â·ÉÏµÄÑý¹ÖÓÖÊÇÔõÃ´ÖªµÀµÄÄØ£¿\n",
        "°×°Ö°Ö£ºÄã¿´Õâ¸ö£¡\n"
        "£¨ÖÚÈË£©£º°¡£¿¡¶Î÷ÓÎÈÕ±¨¡·£¿\n"
        "°×°Ö°Ö£º²»´í£¬Õâ¾ÍÊÇÌìóÃ¹ú·¢ÐÐµÄ±¨Ö½¡£ÈçÀ´Ö÷±à£¬ÄãÒ»\n"
        "        Â·ÉÏµÄÑý¹Ö¶¼Òª¶©ÔÄµÄ¡£Ã¿ÌìÒ»ÆÚ£¬ÄãÃÇµÄ¶¯Ì¬ÎÒ\n"
        "        ÃÇËæÊ±ÕÆÎÕ¡£\n",
        "Îò¿Õ  £ºÈçÀ´ºÃÎÞÁÄ°¡£¿\n"
        "°×°Ö°Ö£º·Ï»°£¡Òª²»È»ÄãÃÇÄÄÀïÀ´µÄ°ËÊ®Ò»ÄÑ£¡ÕâÑùÒ»À´£¬\n"
        "        ÈçÀ´»¹¿ÉÒÔµ±Ö÷±àÕõÐ©Áã»¨£¬ËûÃÇÔç¾ÍËã¼ÆºÃÁË¡£\n"
        "        ÌÆÉ®Èâ³ÔÁËÄÜ³¤Éú²»ÀÏÒ²ÊÇ±¨ÉÏµÄ¹ã¸æËµµÄÄØ£¡\n",
        "ÌÆÉ®  £ºÆ­ÈËµÄÀ²£¡ÎÒÒªÓÐÕâÃ´À÷º¦µÄÈâ£¬ÎÒ×Ô¼º¾ÍÏÈ³ÔÒ»\n"
        "        ¿éÁË£¬»¹È¡Ê²Ã´¾­°¡£¡\n"
        "°×°Ö°Ö£ººß£¡ÄãÃÇ»¹²»ÊÇ½èÈ¡¾­µÄÃûÍ·¹«·ÑÂÃÓÎÂï£¡\n"
        "Îò¿Õ  £ºÊ²Ã´£¿ÄãÓÐÃ»ÓÐ¸ã´í°¡£¡ÎÒÃÇÒ»Â·×ßÀ´£¬È´Ò½ÉÙÒ©\n"
        "        ²»Ëµ£¬ÓÖÃ»ÓÐ¹Ì¶¨×¡´¦£¬ÓÖÃ»ÓÐ¹Ì¶¨µÄÊÕÈë¡£ÊµÔÚ\n"
        "        ²»ÐÐÎÒÃÇ°Ú¹ýµØÌ¯£¬Ë£¹ýÂíÏ·£¬Âô¹ý³ª£¬Âô¹ýÒÕ£¬\n"
        "        Ê²Ã´Ã»ÓÐ¸É¹ý£¡ÄãÈ¥³ÔÊº°ÉÄã£¡\n",
        "°×°Ö°Ö£ºÅ¶£¿Éú»îÂù¶à×Ë¶à²ÊµÄÂï£¡\n"
        "É³É®  £º²»ÈçÄãÒ²À´ÊÔÊÔ°¡£¿\n"
        "°×°Ö°Ö£ººÃ°¡£¡·´Õý¼ÒÀïÒ²ËÀ¹â¹âÁË£¬²»ÈçÎÒÃÇÒ»Æð×ß°É£¿\n",
        "Îò¿Õ  £º¶ÔÑ½£¬¶à¸öÅóÓÑ¶àÌõÂ·£¬Ò»Æð×ß°É£¡\n"
        "ÌÆÉ®  £ºÄÇÒ»Â·ÉÏÆñ²»ÓÖ¶àÁËÒ»¸öÈËµÄ¿ªÏú£¿\n",
        "°×°Ö°Ö£º²»Òª½ô£¬ÎÒ»áÉÕ»ð×ö·¹£¬¿´º¢×ÓÏ´Íë£¬ÊÕÊ°ÎÝ×Ó£¬\n"
        "        Ï´ÒÂ·þ£¬Ë¢ÂíÍ°£¬µ¹ÌµÓÛ£¬ÄÜÈËËù²»ÄÜ£¬²»»á¸øÄã\n"
        "        ÃÇÌíÂé·³µÄ¡£\n",
        "É³É®  £ººÃ°¡£¡´Ó½ñºó£¬Äã¾ÍÊÇÊ¦¸µ×îÐ¡µÄÍ½µÜÁË£¬ÕâÌôµ£\n"
        "        ×ÓµÄÊÂ¾ÍÊÇÄãµÄÁË¡£\n,"
        "°×°Ö°Ö£ºÔ¸ÒâÐ§ÀÍ£¡\n"
        "\n\n[1;35m£¨ÒôÀÖÉùÆð£ºÄãÌô×Åµ££¬ÎÒÇ£×ÅÂí£¬Ó­À´ÈÕ³öËÍ×ßÍíÏ¼¡­¡­£©[m\n",
});  
          
