#include <ansi.h>

inherit ITEM;
void create()
 {
    set_name("¼ÒÍ¥Ó°Ôº", ({"vcd"}) );
    set_weight(1000);
    if( clonep() )
           set_default_object(__FILE__);
    else {
        set("unit", "Ì¨");
        set("long", "Ò»Ì¨¸ß¼¶¼ÒÍ¥Ó°Ôº,ÉÏÃæÓÐplay,shut,kala,stopÒ»Ð©×ÖÑù.\n");
         set("no_get",1);
         set("value",10000);
    }
    setup();
}

void init()
{
       add_action("do_play", "play");
}


int do_play()
{
                if (this_object()->query_temp("play")==1) return notify_fail("ÏÖÔÚÕýÔÚ·Å×Å£Ö£Ã£ÄÄØ¡£\n");
                if (this_object()->query_temp("kala")!=0) return notify_fail("ÏÖÔÚÕýÓÐÈË³ª¿¨À²£Ï£ËÄØ¡£\n");
                this_object()->set_temp("play",1);
                call_out("start_play",2);
                return 1;
}

int start_play()
{
        call_out("continue_play",1,-1); 
        return 1;       
}

int continue_play(int release)
{

string *str1=({
"       ÏÂÃæÎÒÎª´ó¼ÒÑÝ³ªÒ»Ê×¸è,Ï£Íû´ó¼ÒÏ²»¶.\n\n",
"ÈÃÎÒ±¯Ò²ºÃ ÈÃÎÒ»ÚÒ²ºÃ\n",
"ºÞ²ÔÌìÄã¶¼²»Ã÷ÁË\n",
"ÈÃÎÒ¿àÒ²ºÃ\n",
"ÈÃÎÒÀÛÒ²ºÃ\n",
"Ëæ·çÆ®Æ®ÌìµØÈÎåÐÒ£\n",
"Ó¢ÐÛ²»ÅÂ³öÉíÌ«µ­±¡\n",
"ÓÐÖ¾Æø¸ßÄÄÌìÒ²½¾°Á\n",
"¾ÍÎªÒ»¸öÔµ×ÖÇéÄÑÁË\n",
"Ò»ÉúÒ»ÊÀÏë²¶²¶²»ÀÎ\n",
"Ïà°®ÉîÉîÌì¶¼¿´²»µ½\n",
"¶÷Ô¹ÊÀÊÀ´ú´úÐÄÍ·ÉÕ\n",
"ÓÐ°®ÓÐÐÄ²»ÄÜ»îµ½ÀÏ\n",
"½ÐÎÒÔõÄÜÍü¼ÇÄãµÄºÃ\n",
"ÈÃÎÒ±¯Ò²ºÃ ÈÃÎÒ»ÚÒ²ºÃ\n",
"ºÞ²ÔÌìŠ…¶¼²»Ã÷ÁË\n",
"ÈÃÎÒ¿àÒ²ºÃ\n",
"ÈÃÎÒÀÛÒ²ºÃ\n",
"ÈÃÎÒÌìÌì¿´µ½ËýµÄÐ¦\n",
"ÈÃÎÒ×íÒ²ºÃ ÈÃÎÒË¯Ò²ºÃ\n",
"°Ñ³îÇé·³ÊÂ¶¼ÍüÁË\n",
"ÈÃÎÒ¶ÔÒ²ºÃ ÈÃÎÒ´íÒ²ºÃ\n",
"Ëæ·çÆ®Æ®ÌìµØÈÎåÐÒ£\n",
"Ó¢ÐÛ²»ÅÂ³öÉíÌ«µ­±¡\n",
"ÓÐÖ¾Æø¸ßÄÄÌìÒ²½¾°Á\n",
"¾ÍÎªÒ»¸öÔµ×ÖÇéÄÑÁË\n",
"Ò»ÉúÒ»ÊÀÏë²¶²¶²»ÀÎ\n",
"Ïà°®ÉîÉîÌì¶¼¿´²»µ½\n",
"¶÷Ô¹ÊÀÊÀ´ú´úÐÄÍ·ÉÕ\n",
"ÓÐ°®ÓÐÐÄ²»ÄÜ»îµ½ÀÏ\n",
"½ÐÎÒÔõÄÜÍü¼ÇÄãµÄºÃ\n",
"ÈÃÎÒ±¯Ò²ºÃ ÈÃÎÒ»ÚÒ²ºÃ\n",
"ºÞ²ÔÌìÄã¶¼²»Ã÷ÁË\n",
"ÈÃÎÒ¿àÒ²ºÃ ÈÃÎÒÀÛÒ²ºÃ\n",
"ÈÃÎÒÌìÌì¿´µ½ËýµÄÐ¦\n",
"ÈÃÎÒ×íÒ²ºÃ ÈÃÎÒË¯Ò²ºÃ\n",
"°Ñ³îÇé·³ÊÂ¶¼ÍüÁË\n",
"ÈÃÎÒ¶ÔÒ²ºÃ ÈÃÎÒ´íÒ²ºÃ\n",
"Ëæ·çÆ®Æ®ÌìµØÈÎåÐÒ£\n",
"ÈÃÎÒ±¯Ò²ºÃ ÈÃÎÒ»ÚÒ²ºÃ\n",
"ºÞ²ÔÌìÄã¶¼²»Ã÷ÁË\n",
"ÈÃÎÒ¿àÒ²ºÃ ÈÃÎÒÀÛÒ²ºÃ\n",
"Ëæ·çÆ®Æ®ÌìµØÈÎåÐÒ£\n",
"Ëæ·çÆ®Æ®ÌìµØÈÎåÐÒ£\n",

"\n\n[1;32mÐ»Ð»´ó¼Ò,Ð»Ð»¸÷Î»µÄÕÆÉù!\n",
});

        if (release==0) {
                this_object()->set_temp("play",0);
                return 0;
        }
  
      if (release==-1) {
                continue_play(sizeof(str1));
                return 1;
        }
this_player()->command_function("chat "+str1[sizeof(str1)-release]);
      call_out("continue_play",1,release-1);
        return 1;
}

