#include <ansi.h>

inherit ITEM;
void create()
 {
    set_name("¼ÒÍ¥Ó°Ôº", ({"vcd"}) );
    set_weight(1000);
    if( clonep() )
           set_default_object(__FILE__);
    else {
        set("unit", "Ì¨");
        set("long", "Ò»Ì¨¸ß¼¶¼ÒÍ¥Ó°Ôº,ÉÏÃæÓÐplay,shut,kala,stopÒ»Ð©×ÖÑù.\n");
         set("no_get",1);
         set("value",10000);
    }
    setup();
}

void init()
{
       add_action("do_play", "play");
}


int do_play()
{
                if (this_object()->query_temp("play")==1) return notify_fail("ÏÖÔÚÕýÔÚ·Å×Å£Ö£Ã£ÄÄØ¡£\n");
                if (this_object()->query_temp("kala")!=0) return notify_fail("ÏÖÔÚÕýÓÐÈË³ª¿¨À²£Ï£ËÄØ¡£\n");
                this_object()->set_temp("play",1);
                call_out("start_play",2);
                return 1;
}

int start_play()
{
message("channel:chat",HIR+"¡¼"HIG"Ä§»ÃµçÌ¨"HIR"¡½£º"NOR+HIY"Ò»¸ö¹Å¹ÖµÄºÐ×ÓÔÚ×÷¹ÖÁË¡£\n"+NOR,users());
        call_out("continue_play",1,-1); 
        return 1;       
}

int continue_play(int release)
{
object npc = load_object("/u/gslxz/npc/baomu");

string *str1=({
"\n\n                 [1;33m  Îò¿ÕÈý´ò°×¹Ç¾« [m               \n",

        "\n»°ËµÕâÒ»ÈÕ£¬ÌÆÉ®Ê¦Í½ËÄÈËÀ´µ½ÁËÒ»×ù´óÉ½½ÅÏÂ¡£\n",
        "\nÌÆÉ®£ºÍ½¶ù£¬ÕâÀïÊÇ¸öÊ²Ã´È¥´¦£¿ÕæÊÇÌ«~~~~~ºÃ¿´À²£¡\n",
        "\nÎò¿Õ£ºÊ¦¸µ£¬Àë¿ª¶«ÍÁ´óÌÆÒÑ¾­ºÃ¼¸ÄêÁË£¬ÄãÔõÃ´»¹ÊÇÕâ¸öÑù×Ó£¿\n",
        "\n      Ò»×ùÊ¯Í·É½¶øÒÑ£¬ÓÐÊ²Ã´ºÃ¿´µÄ£¿ËµÄãÊÇÍÁ±î£¬ÓÖÅÂ¹ÛÒô½ã\n",
        "\n      ½ãÂîÎÒ£¬ÔÚÕâ×ùÉ½ÉÏËæ±ãÕÒÒ»¿éÊ¯Í·¶¼±ÈÄãÓÐ¼ûÊ¶£¡ÏñÄãÕâ\n",
        " \n     ÑùÔõÃ´ÕÖµÄ×¡´ó¼Ò£¿ÎÒÃÇºÃÀµÒ²»áÒ»µã·¨Êõ£¬¾ÍÁ¬ÄãÆïµÄÄÇ\n",
        "\n      Æ¥ÂíÒ²Ò»ÏÂ×Ó¾Í°ÑÄãÌß·­ÁË£¬Äã³ýÁËÃ»ÍêÃ»ÁËµÄ¸øÎÒÃÇÕÒÂé\n",
        "\n      ·³£¬°ÝÍÐÄãÒ²Ñ§Ò»µã±ðµÄ±¾ÊÂ£¡ \n",
        "\nÌÆÉ®£º¿¿£¡ÎÒÖ»²»¹ýÊÇËæ±ãÊæÁËÒ»ÏÂÇé£¬Äã¾ÍÕâÃ´ÆÅÆÅÂèÂè¡¢ßóßó\n",
        "\n      ÍáÍá¡¢ÂÞÀïÂÞËô£¬Äã»¹Ïë²»Ïë»ìÁË£¿ \n",
        "\nÉ³É®£ººÃÁËºÃÁË£¬´ó¼Ò¶¼ÊÇ³öÀ´¸ø¹ÛÒôÈçÀ´´ò¹¤µÄ£¬ºÎ±ØÄØ£¿\n",
        "\nÌÆÉ®£ºÎÒºÍÄã´óÊ¦ÐÖËµ»°Ê²Ã´Ê±ºòÂÖµ½Äã²å×ìÁË£¿ÎªÁË°âÄãÕâ\n",
        "\n      ¸öÃ«²¡£¬ÎÒÒÑ¾­°ÑÄã´óÊ¦ÐÖµÄ½ð¹¿´÷ÔÚÁËÄãÍ·ÉÏ£¬ÄãÓÖ\n",
        "\n       À´£¿\n",
        "\nÉ³É®£ºok£¡ÎÒ±Õ×ìÏÈ£¡\n",
        "\nÌÆÉ®£º°Ë½ä£¬ÎªÊ¦µÄÓÖ¸ÃËµËµÄãÁË¡£ËäÈ»Äã×î½ü¼õ·ÊÓÐÐ©³ÉÐ§£¬\n",
        "\n      ËäÈ»É³É®²»Ï²»¶ºÍ±ðÈËÕù±ç£¬¿ÉÄã¾Í¿´ÔÚËû¼çÉÏÌô×ÅÐÐ\n",
        "\n      ÀîµÄ·ÝÉÏ¡­¡­Äã¾Í±ðÕâÑùÁË¡£\n",
        "\n°Ë½ä£ºÎÒÕâÒ²ÊÇÎªÁË´ó¼ÒºÃ°¡£¡ÎÒÀÏÖíÒ»×ßÂ·¾ÍÈÝÒ×¶ö£¬¾ÍÃâ\n",
        "\n      ²»ÁËÈÃ´ó¼ÒÈ¥»¯Õ«£¬¾ÍÃâ²»ÁËµ¢ÎóÁËÈ¡¾­µÄÊ±ÈÕ¡£\n",
        "\nÌÆÉ®£ºÄÇÊÇÎÒ´í¹ÖÄãÁË£¬Äã¾Í¼ÌÐøÔÚÄãÊ¦µÜ²±×ÓÉÏÆï×Å°É¡£\n",
       "\nÉ³É®£º#£¤@$^ÌÆÉ®£ºÎò¿Õ£¬ÈÃËûÕâÃ´Ò»Ëµ£¬ÎÒ»¹ÕæÓÐÐ©¶ö\n",
        "\n      ÁË£¬¾ÍÀÍ·³Äã×ßÒ»ÌË°É£¡\n",
        "\nÎò¿Õ£ºÓÖÊÇÎÒ£¿ÂÖÒ²ÂÖµ½ÄãÈ¥ÁË°É£¿\n",
        "\nÌÆÉ®£º´ÓÀíÂÛÉÏÀ´½²£¬ÎÒÓ¦¸ÃÈ¥»¯Õ«µÄ£¬¿ÉÈË¼ÒÕâÁ½Ìì¡­\n",
        "\n      ¡­²»Ì«·½±ã¡­¡­\n",
        "\n¡¡¡¡£¨¼¯ÌåÔÎµ¹£©\n",
        "\nÎò¿Õ£ººÃ£¬ÎÒÈ¥£¡\n",
        "\n°Ë½ä£ºµÈÒ»µÈ£¬ÍòÒ»Ò»»á¶ùÀ´¸öÊ²Ã´ÈË°¡Ñý°¡µÄ£¬À´½ÙÉ«\n",
        "\n      ÔõÃ´°ì£¿\n",
        "\nÉ³É®£º°ÝÍÐ£¬Äã¿´¿´ÎÒÃÇÒ»¸ö¸ö¹âÍ·µÄ¹âÍ·£¬´óºú×ÓµÄ´ó\n",
        "\n      ºú×Ó£¬Ê²Ã´ÈËÑý¸ÒÀ´½ÙÎÒÃÇ°¡£¿\n",
        "\n°Ë½ä£º±äÌ¬£¡\n",
        "\nÉ³É®£º°¡£¿ÕâÒ²±»Äã¿´³öÀ´ÁË£¿Ã»´í£¬ÎÒµÄºú×ÓÊÇÌùÉÏµÄ\n",
        "\n      £¬ÎÒ¾õµÃ×÷ÎªÒ»¸öÄÐÈËÂï¡­¡­\n",
        "\n°Ë½ä£ºstop£¡ÎÒÊÇËµ±äÌ¬»áÀ´½ÙÎÒÃÇ°¡£¡\n",
        "\nÌÆÉ®£ºÊÇ°¡£¡Îò¿Õ£¬Õâ»Ä½¼Ò°ÍâµÄ£¬ÄÑÃâ»áÓÐÊ²Ã´¶«¶«³ö\n",
        "\n      À´£¬Äã¿´¡­¡­\n",
        "\nÎò¿Õ£ºÕæÊÇÂé·³ÄÄ£¡ÔçÖªµÀÕâÑù£¬ÎÒ¾Í×Ô¼ºÈ¥È¡¾­ÁË¡£»¹\n",
        "\n      ºÃÎÒÔçÓÐ×¼±¸£¬¿´£¡\n",
        "\n£¨ÖÚÈË£©£º°¡£¡ÊÇµçÍø£¡\n",
        "\nÎò¿Õ£º²»´í£¡Õâ¾ÍÊÇ±£ïÚÅÆµçÍø£¬ËüºÄµçÉÙ£¬Ò×²Ù×÷£¬µç\n",
        "\n      Ñ¹¿Éµ÷£¬°²È«ÐÔ¸ß£¬¸üÓÐ½»Ö±Á÷Á½ÓÃµÄÐÍºÅ£¬¶ÀÓÐ\n",
        "\n      µÄÂ©µç±£»¤×°ÖÃ£¬ÌØ±ðÊÊºÏ¼ÒÖÐÓÐÐ¡º¢µÄ¼ÒÍ¥£¬Ëû\n",
        "\n      µÄ¶ÀÌØÕÛµþÉè¼Æ£¬¸ü±ãÓÚÐ¯´ø£¬ÊÇ¾Ó¼ÒÂÃÓÎ±Ø±¸Ö®\n",
        "\n      ¼ÑÆ·£¡¶øÇÒ²»¹óßÏ£¡´ÓÏÖÔÚ¿ªÊ¼Ö»ÒªÄú²¦´òÎÒÃÇµÄ\n",
        "\n      Ö±ÏúÃâ·Ñµç»°£¬ÎÒÃÇµÄ¹¤×÷ÈËÔ±»áÔÚ24Ð¡Ê±ÄÚÎªÄú\n",
        "\n      Ãâ·ÑÉÏÃÅ°²×°µ÷ÊÔ£¡²¢»áËÍÄãÒ»¸ö¾«ÃÀµÄµç¶¯¶úÍÚÉ×£¡\n",
        "\nÉ³É®£º´óÊ¦ÐÖ£¬ÎÒÖªµÀÁË£¬ÎÒÓÐ´øµç³ØÒ®£¡\n",
        "\nÎò¿Õ£º¹Ô£¡~~~~~ÀÏËïÕâ¾ÍÈ¥Ò²£¡\n",
        "\nÌÆÉ®£ºµÈÒ»µÈ£¡Îò¿Õ£¬Äã°ÑÉ³É®±³µÄË®¸×´øÉÏ£¬Õâ´ÎÄã¶à\n",
        "\n      »¯Ð©Õ«·¹À´£¬ÎªÊ¦µÄÓÐÐ©¶öÁË£¡\n",
        "\nÎò¿Õ£º¡­¡­ÁË½â£¡\n",
        "\n\n¡¡¡¡£¨Óë´ËÍ¬Ê±£¬ÔÚ´ËÉ½µÄÉ½¶´Àï°×¹Ç¾«Ò»¼ÒÈý¿ÚÕýÔÚ¿´µçÊÓ£©\n",
        "\n°×°Ö°Ö£ºµçÊÓ½ÚÄ¿ÕæÊÇÃ»ÒâË¼£¬Ò»Ììµ½ÍíÒ²Ã»Ê²Ã´ºÃ¿´µÄ\n",
        "\n        ¡£´ÓÂò»Ø¼ÒºóÎÒ»¹Ã»¼û¹ýËû·Åµã±ðµÄ£¡\n",
        "\n°×¶ù×Ó£ºÔç¾Í¸æËßÄãÓ¦¸Ã×°Ò»ÌõÌìÏßµÄ£¬±¾À´¾ÍÊÇÔÚ´óÉ½\n",
        "\n        Àï£¬Ã»ÓÐÐÅºÅ£¬µ±È»¾ÍÖ»ÓÐÑ©»¨¿´ÁË¡£\n",
        "\n°×ÂèÂè£ºÒÀÎÒ¿´£¬µ½ÁËÍíÉÏËüµÄÓÃ´¦»á´óÒ»Ð©£¬Ö»Òª¹Øµô\n",
        "\n        ÉùÒô£¬ÔÛÃÇ¿ÉÒÔÓÃËüÀ´µ±Ì¨µÆÂï£¡\n",
        "\n°×¶ù×Ó£ºÐê¡­¡­ºÃÏñÓÐÉùÒôÒ®£¡\n",
        "\n°×ÂèÂè£º×¼ÊÇÄã°Ö°Ö´ó±ãÍêÏ´ÊÖÊ±Ã»ÓÐ¹ØºÃË®ÁúÍ·¡£\n",
        "\n°×°Ö°Ö£º¿¿£¡ÎÒÒÑ¾­Èý¸ö¶àÔÂÃ»ÓÐ³ÔÈËÁË£¬ÄÄÀ´µÄ´ó±ã°¡\n",
        "\n        £¿ËµÊµÔÚµÄ£¬ÏÖÔÚÒªÊÇÓÐ´ó±ãÎÒ¶¼Ïë³ÔÁË£¡\n",
        "\n°×¶ù×Ó£ºÁ½¸ö°×³Õ£¬¿´±¨Ö½ÁËÃ´£¿¡¶Î÷ÓÎÈÕ±¨¡·ÉÏËµÌÆÉ®\n",
        "\n        ¾ÍÒªÀ´ÁË£¡³ÔÁËËûµÄÈâ£¬²»µ«¿ÉÒÔÑÓÄêÒæÊÙ£¬³¤\n",
        "\n        Éú²»ÀÏ£¬»¹¿ÉÒÔÖ¹¿È»¯Ìµ¡¢ÇåÑÊÈóºí£¬ÉÏÌì°²ÅÅ\n",
        "\n        µÄ»ú»á£¬ÎÒÃÇÃ»ÓÐÀíÓÉ´í¹ýµÄ£¡\n",
        "\n°×°Ö°Ö£º½ðÉ¤×Óºí±¦£¿¿ì³öÈ¥¿´¿´ÏÈ£¡\n",
        "\n°×¶ù×Ó£º²»¹ýÌýËµÌÆÉ®ÊÖÏÂÓÐ¸öºÚÉç»áÐÔÖÊµÄÉçÍÅ×éÖ¯£¬\n",
        "\n        ÎªÊ×µÄËïÎò¿ÕÊÇÎå°ÙÄêÇ°´óÄÖ·ïÀ´Â¥µÄÆëÌì´óÊ¥£¡\n",
        "\n°×ÂèÂè£ºÆëÌì´óÊ¥£¿ÊÇÐÇ³ÛÐéÄâÉçÇøÀïµÄÄÇ¸öÃ´£¿ÎÒÖªµÀµÄ¡£\n",
        "\n°×¶ù×Ó£ºÄÇ¸öÊÇ¼ÙµÄÀ²£¬ÄãÔÙÂÒ²å×ìÐ¡ÐÄÎÒ²å~~~~~~~~~±¬\n",
        "\n        ÄãµÄÑÛ¾¦£¡ÚÀ£¡ÕæÊÇÃ»°ì·¨£¬ÄãÃÇÏÈ°ÑË®ÉÕ¿ª£¬ÎÒ\n",
        "\n        È¥¿´¿´ÏÈ£¡\n",
        "\n°×°Ö°Ö£ºÐ¡ÐÄ°¡£¡¶ù×Ó£¡\n",
        "\n\n     £¨°×¶ù×ÓÀ´µ½ÁËÌÆÉ®ÐÝÏ¢µÄµØ·½¡­¡­£©\n",
        "\n°×¶ù×Ó£ºÊ¦¸µÃÇºÃ£¡\n",
        "\nÌÆÉ®£º  Ð¡ÅóÓÑºÃ£¬ÄãÒ»¸öÈËÔÚ¸ÉÊ²Ã´ÄØ£¿\n",
        "\n°×¶ù×Ó£ºÎÒ»Ø¼Ò£¬Ç°Ãæ²»Ô¶¾ÍÊÇÎÒ¼ÒÁË£¬ÎÒ°Ö°ÖÂèÂè×öºÃÁË\n",
        "\n        ·¹²ËµÈÎÒ»Ø¼Ò³Ô·¹ÄØ£¡\n",
        "\n°Ë½ä£º  Ê²Ã´£¿ÓÐ·¹²Ë£¿Ê¦¸µ£¬´óÊ¦ÐÖºÃ¾ÃÒ²²»»ØÀ´£¬¸É´àÔÛ\n",
        "\n        ÃÇ¸úÐ¡¼Ò»ïÒ»Æð»Ø¼ÒËãÁË¡£\n",
        "\nÌÆÉ®£º  ÄãÒ²Ì«ÎÞÀñÁË£¬ÈË¼Ò¶¼Ã»ÒªÎÒÃÇÈ¥£¬ÎªÊ¦ÔõºÃÒâË¼¿ª\n",
        "\n         ¿Ú£¿ÄãÒ»¸öÀÏÖíÏòÈË¼ÒÐ¡ÅóÓÑÌÖ·¹£¬Äã²Ñ²»²ÑÀ¢Ñ½£¡\n",
        "\n°×¶ù×Ó£ºÃ»¹ØÏµ£¬ÎÒ¼ÒÒ²ÊÇÐÅ·ðµÄ£¬ÎÒ¸¸Ä¸Ò»¶¨»áºÜ¸ßÐË´ó¼Ò\n",
        "\n        Ò»ÆðÈ¥µÄ¡£\n",
        "\nÌÆÉ®£º  Å¶£¿Äã¼Ò»¹ÓÐ±ðÈËÃ´£¿\n",
        "\n°×¶ù×Ó£ºÎÒ¼ÒÖ»ÓÐÎÒÃÇÈýÈË¡£\n",
        "\nÌÆÉ®£º  ÕæÊÇÒ»¶Ô·òÆÞÒ»¸öÍÞ£¬¼´Àû¹úÀ´ÓÖÀû¼Ò°¡£¡É³É®£¬Äã\n",
        "\n        °ÑµçÍøÊÕºÃ£¬ÎÒÃÇ²»µÈÎò¿ÕÁË¡£\n",
        "\n\n¡¡¡¡£¨ÕâÊ±Îò¿ÕÇ¡ºÃ¸Ï»ØÀ´ÁË£©\n",
        "\nÎò¿Õ£º  ß¾£¡³Ô°³ÀÏËïÒ»°ô£¡\n",
        "\nÌÆÉ®£º  ×¡ÊÖ£¡Äã´òÐ¡ÅóÓÑÎÒ¾Í²»ËµÄãÊ²Ã´ÁË£¬¿ÉÊÇÄãÒ²Ó¦¸Ã\n",
        "\n        ÃéµÃ×¼Ò»Ð©Ñ½£¿Äã²îÒ»µã¾Í´òµ½ÎÒÁË£¡\n",
        "\nÎò¿Õ£º  ¶Ô²»Æð£¡¶Ô²»Æð£¡ÎÒÖØÐÂ´ò¹ý¡£ß¾£¡³Ô°³ÀÏËïÒ»°ô£¡\n",
        "\n°×¶ù×Ó£º°¡£¡£¨µ±³¡±ÐÃü£©£¨ÐÄÏë£º¿¿£¡Ì«µ¹Ã¹ÁË£¬ËµÊ²Ã´¶ù\n",
        "\n        Í¯ÊÇÎ´À´µÄÖ÷ÈËÎÌ£¬ÎªÊ²Ã´ÏÈËÀµÄÊÇÎÒ£¡£©\n",
        "\n°Ë½ä£º  ²»µÃÁËÀ²£¡´óÊ¦ÐÖ´òËÀÈËÀ²£¡\n",
        "\nÉ³É®£º  ºß£¡ÉÙ¼û¶à¹Ö£¡\n",
        "\nÌÆÉ®£º  °Ë½ä£¬Äã´óÊ¦ÐÖÒ»Â·ÉÏÒÑ¾­É±ÁËÕâÃ´¶àÉúÁé£¬Äã½Ð¸ö\n",
        " \n       Í·°¡£¡²»¹ýÎò¿Õ£¬Õâ´ÎÄã¿É´íÁË£¬ÎÒ¸Õ²ÅÎÊ¹ýÕâ¸öÐ¡\n",
        " \n       ÅóÓÑ£¬Ëû¼ÒÀïÒ»¼ÒÈý¿Ú£¬ËûÊÇ¶ÀÉú×Ó£¬²»ÊÇ¼Æ»®ÍâÉú\n",
        " \n       Óý£¬Äã²»Ó¦¸ÃÉ±Ëû¡£\n",
        "\nÎò¿Õ£ºÊ¦¸µ£¬Õâ·½Ô²°ÙÀïÄÄÀ´µÄÈË¼Ò£¿\n",
        "\nÌÆÉ®£ºÒ²ÐíÊÇÂ¶ÓªµÄÄØ£¿\n",
        "\nÎò¿Õ£ºÂ¶ÄãÀÏÄ¸£¡\n",
        "\nÌÆÉ®£ºÄã¸ÒÂîÎÒ£¡\n",
        "\nÎò¿Õ£ºÒª²»ÊÇ¿´ÔÚ¹ÛÒôÆÐÈøµÄ·ÝÉÏ£¬ÎÒ»¹Òª´òÄãÄØ£¡\n",
        "\nÌÆÉ®£º¡ò¡ù¡ø¡÷£À£¦££¡ö¡î¡ì¡þ¡ô¡ó¡­¡­£¨½ô¹¿Öä£©\n",
        "\nÉ³É®£ºÊ¦¸µÄªÄî£¡\n",
        "\nÌÆÉ®£ºSORRY£¡ÎÒÍü¼Ç½ð¹¿ÔÚÄãÍ·ÉÏÁË¡£\n",
        "\nÎò¿Õ£º¿´Äã»¹»áÊ²Ã´£¡\n",
        "\nÌÆÉ®£ººÃ£¬I·þÁËU¡£²»ÈçÔÛÃÇ³Ô·¹ÏÈ£¡\n",
        "\nÎò¿Õ£ºÔçÕâÑù¶àºÃ£¡\n",
        "\n\n¡¡¡¡£¨É½¶´ÀïµÄÁ½¹øË®¶¼ÉÕ¸ÉÁË£¬»¹²»¼û°×¶ù×Ó»ØÀ´£©\n",
        "\n°×°Ö°Ö£ºÀÏÆÅ£¬¶ù×ÓÔõÃ´»¹²»»ØÀ´£¿\n",
        "\n°×ÂèÂè£ºÊÇ°¡£¬×¼ÊÇºÍ±±É½ºüÀê¾«¼ÒµÄÐ¡Å®º¢ÍæÈ¥ÁË£¬Äã¿É¸Ã\n",
        "\n        ºÃºÃ¹Ü½ÌÒ»ÏÂ¶ù×ÓÁË£¬Ã÷Äê¾Í¸ß¿¼ÁË£¬Ð¡ÐÄÔçÁµ£¡\n",
        "\n°×°Ö°Ö£ºÄãÉñ¾­°¡£¡Äã¼û¹ýÒ»¶Ñ°×¹ÇºÍÒ»Ö»ºüÀê½á»éµÄÃ´£¿\n",
        "\n        ¿Æ»ÃÐ¡Ëµ°¡£¿ÎÀË¹Àí°¡£¿ÄãÊ¡Ê¡°É¡£\n",
        "\n°×ÂèÂè£º¾ÍÄã¶®£¡²»ÐÐ£¬ÎÒµÃÈ¥ÕÒÕÒËû£¡\n",
        "\n°×°Ö°Ö£ººß£¡Å®ÈË£¡\n",
        "\n°×ÂèÂè£º´í£¡Ó¦¸Ã½ÐÅ®¹í£¡\n",
        " \n£¨°×ÂèÂèÕÒÀ´ÁË¡­¡­£©\n",
        "\n°×ÂèÂè£º¸÷Î»Ê¦¸µ£¬ÄãÃÇ¸Õ²Å¿É¿´¼ûÒ»¸öÐ¡ÄÐº¢¾­¹ýÕâÀïÃ´£¿\n",
        "\nÌÆÉ®  £ºÎÒÃÇÒ²ÊÇ¸ÕÀ´µÄ£¬ÎÒÃÇÊ²Ã´Ò²Ã»¿´¼û¡£\n",
        "\n°Ë½ä  £ºÊÇ°¡£¡¾ÍËãÎÒÃÇ¿´¼ûÁËÒ»¸öÐ¡ÄÐº¢£¬ÎÒÃÇÒ²Ã»ÓÐÉ±ÁËËûÑ½£¡\n",
        "\nÎò¿Õ  £º¿¿£¡ÄãÖíÄÔ°¡£¿\n",
        "\n°Ë½ä  £º¶ÔÑ½£¿\n",
        "\nÉ³É®  £º¶þÊ¦ÐÖ£¬Äã¾ÍÉÙËµÁ½¾ä°É¡£\n",
        "\n°×ÂèÂè£ºÊ²Ã´£¿£¨Ò»ÑÛ¿´¼ûÁËµØÉÏµÄÊ¬Ìå£©ÕâÊÇË­¸ÉµÄ£¿\n",
        "\nÌÆÉ®  £ºÎÒÔç¾Í¸æËß¹ýÄãÃÇÉ±ÍêÈËÒÔºóÒª´¦ÀíºÃÏÖ³¡µÄ£¬²»È»ºÜ\n",
        "\n        ÈÝÒ×ÈÃÈË¼Ò×¥µ½µÄ¡£Äã¿´£¬ÈÃÎÒËµÖÐÁË²»ÊÇ£¿\n",
        "\nÎò¿Õ  £º±ÕÉÏÄãµÄÎÚÑ»×ì£¡\n",
        "\n°×ÂèÂè£º°¡£¡~~~~~¶ù×Ó°¡£¬ÄãËÀµÄºÃ²Ò°¡£¡ÊÇË­É±ÁËÄãÑ½£¡\n",
        "\nÌÆÉ®  £º²»ÊÇÎÒ¡£\n",
        "\n°Ë½ä  £º²»ÊÇÎÒ¡£\n",
        "\nÉ³É®  £º²»ÊÇÎÒ¡£\n",
        "\n°×ÂèÂè£ºÄÇÒ»¶¨¾ÍÊÇÄãÁË£¡ÕâÊÇÊ²Ã´ÊÀµÀ°¡£¡Á¬Âí¶¼»áÉ±ÈË°¡£¡\n",
        "\n°×ÁúÂí£º°ÝÍÐ£¬ÎÒÈÃÈË¼ÒÆï»¹Æï²»¹ýÀ´ÄØ£¬ÄÄÓÐÊ±¼äÉ±ÈË°¡£¿ÄÇ\n",
        "\n        ±ß»¹Õ¾×ÅÒ»¸öÄØ¡£\n",
        "\n°×ÂèÂè£ºÎÒÖªµÀ£¬Ëû²»¾ÍÊÇËïÎò¿Õ÷á£¬¿ÉÎÒ´ò²»¹ýËûÑ½£¬Äã¾Í½«\n",
        "\n        ¾Í×ÅÈÃÎÒËæ±ãõßÁ½½Å½â½âÆø¾ÍÐÐÁË¡£\n",
        "\nÎò¿Õ  £ºÐ¡ÐÄÎÒ¸æÄãÅ°´ý³èÎï£¡\n",
        "\n°×ÁúÂí£º¿¿£¡Äã»¹µ±ÎÒÊÇ³èÎï°¡£¡ÄãÃÇÃ¿Ìì³Ô±¥ºÈ×ãÁË£¬Ëæ±ãÕÒ\n",
        "\n        Ð©²ÝÀ´ºýÅªÎÒ£¬ÆäÊµÎÒÒ²ÊÇÁúÍõÈýÌ«×Ó°¡£¡Ò»Ììµ½ÍíÍÔ\n",
        "\n        ×ÅÕâ¸öÅÖºÍÉÐ×ßÀ´×ßÈ¥µÄ£¬ÄÇ¼ÒÊÇÕâÑù¶Ô³èÎïµÄ£¿\n",
        "\nÎò¿Õ  £ººÃºÃºÃ£¬ÎÒ¸æËýÅ°´ýÉüÐó×Ü¿ÉÒÔÁË°É£¿\n",
        "\n°×ÁúÂí£ºÕâ»¹²î²»¶à£¡\n",
        "\n°×ÂèÂè£ººÃÁË£¡ÄãÃÇÒ²¹ØÐÄÒ»ÏÂÎÒµÄº¢×ÓºÃ²»ºÃ£¿\n",
        "\nÎò¿Õ  £ºº¢×ÓËÀÁË¿ÉÒÔÔÙÉúÒ»¸ö£¬ÎÒ¿´Äã»¹ËãÓ²ÀÊ£¬ÀÏ¹«ÉíÌåÒ²²»\n",
        "\n        ´í°É£¿»¹²»¿ì»Ø¼ÒÔÙÉúÒ»¸ö£¿\n",
        "\nÌÆÉ®  £ºÎò¿Õ£¬Äã´òËÀÈË¼ÒµÄº¢×Ó£¬ÔõÃ´»¹¿ÉÒÔÕâÑùºÍÈË¼Ò½²»°£¿\n",
        "\n°Ë½ä  £º¾ÍÊÇµÄ¡£\n",
        "\nÎò¿Õ  £ºÈ¥£¡\n",
        "\nÌÆÉ®  £ºÒª²»ÕâÑù°É£¬ÕâÊÇÊ®Á½Òø×Ó£¬ÄãÄÃ»ØÈ¥°Ñ¶ù×Ó°²ÔáÁËÏÈ¡£\n",
        "\n°×ÂèÂè£ºÊ®Á½£¿´ò·¢Òª·¹µÄ£¿\n",
        "\nÉ³É®  £ºÊ©Ö÷£¬Ê®Á½ÒÑ¾­²»ÉÙÁË£¬ÎÒÌôÒ»ÐÇÆÚµÄµ£×Ó²ÅÒ»Á½°¡£¡\n",
        "\n°×ÂèÂè£ºÎÒÉú¸ö¶ù×ÓÒ²²»ÈÝÒ×£¬¸É´àÒ»¿Ú¼Û£¬¶þÊ®Á½£¡\n",
        "\n°Ë½ä  £ºÇÀ½Ù°¡£¿\n",
        "\nÌÆÉ®  £ºÊ®¶þÁ½¡£\n",
        "\n°×ÂèÂè£ºÊ®¾ÅÁ½¡£\n",
        "\nÌÆÉ®  £ºÊ®ËÄÁ½¡£\n",
        "\n°×ÂèÂè£ºÊ®°ËÁ½¡£\n",
        "\nÌÆÉ®  £ºÊ®ÁùÁ½¡£\n",
        "\n°×ÂèÂè£º³É½»£¡\n",
        "\nÎò¿Õ  £ºß¾£¡³Ô°³ÀÏËïÒ»°ô£¡\n",
        "\n°×ÂèÂè£º°¡£¡~~~~~£¨ËÀÁË£©\n",
        "\nÌÆÉ®  £ºÎò¿Õ£¬ÈË¼ÒÓÖÃ»ÓÐËµÒª³ÔÎÒ£¬ÄãÔõÃ´ÓÖ¿ªÉ±½äÁË£¿\n",
        "\nÎò¿Õ  £ºÎÒ×îÌÖÑá¸úÈË¼ÒÌÖ¼Û»¹¼ÛµÄÅ®ÈË£¬·´ÕýÒ²ÊÇ¸öÑý¹Ö\n",
        "\n        £¬ÓÖÊ¡ÁËÊ®ÁùÁ½Òø×Ó£¬ºÎÀÖ¶ø²»ÎªÄØ£¿\n",
        "\nÌÆÉ®  £ºßí£¡ËµµÄÓÐÐ©µÀÀí£¬¿ì×ß°É£¬±ðÍüÁË°ÑÇ®ÄÃ»ØÀ´£¡\n",
        "\n £¨ÖÕÓÚ°×°Ö°ÖÒ²µÈ²»¼°ÁË£¬ËûÒ»Â·×·ÁË¹ýÀ´¡­¡­£©\n",
        "\n°×°Ö°Ö£ºÄãÃÇ¾ÍÊÇÈ¥Î÷ÌìÈ¡¾­µÄºÍÉÐ£¿\n",
        "\nÌÆÉ®  £º²»´í£¬ÎÒ¾ÍÊÇ¶«ÍÁ´óÌÆÎ÷È¥È¡¾­µÄÉ®ÈË£¬¼ò³ÆÌÆÉ®£¡\n",
        "\n°×°Ö°Ö£ºÄãÃÇ¼¸¸öºÍÉÐºÃ´óµÄµ¨×Ó£¡¾¹¸ÒÉËÎÒÆÞ¶ùÁ½ÌõÐÔÃü£¡\n",
        "\nÌÆÉ®  £º¿¿£¡Ò»¼Ò×Ó¶¼À´ÁË£¬ÎÒÕæ¸ã²»¶®£¬ÎÒ¾ÍÊÇÒ»¸öºÍÉÐ\n",
        "\n        ¶øÒÑ£¬³ÔÁËÎÒµÄÈâÔõÃ´»á³¤Éú²»ÀÏÄØ£¿¼´±ãÊÇÕâÑù£¬\n",
        "\n        ÕâÒ»Â·ÉÏµÄÑý¹ÖÓÖÊÇÔõÃ´ÖªµÀµÄÄØ£¿\n",
        "\n°×°Ö°Ö£ºÄã¿´Õâ¸ö£¡\n",
        "\n£¨ÖÚÈË£©£º°¡£¿¡¶Î÷ÓÎÈÕ±¨¡·£¿\n",
        "\n°×°Ö°Ö£º²»´í£¬Õâ¾ÍÊÇÌìóÃ¹ú·¢ÐÐµÄ±¨Ö½¡£ÈçÀ´Ö÷±à£¬ÄãÒ»\n",
        "\n        Â·ÉÏµÄÑý¹Ö¶¼Òª¶©ÔÄµÄ¡£Ã¿ÌìÒ»ÆÚ£¬ÄãÃÇµÄ¶¯Ì¬ÎÒ\n",
        " \n       ÃÇËæÊ±ÕÆÎÕ¡£\n",
        "\nÎò¿Õ  £ºÈçÀ´ºÃÎÞÁÄ°¡£¿\n",
        "\n°×°Ö°Ö£º·Ï»°£¡Òª²»È»ÄãÃÇÄÄÀïÀ´µÄ°ËÊ®Ò»ÄÑ£¡ÕâÑùÒ»À´£¬\n",
        "\n        ÈçÀ´»¹¿ÉÒÔµ±Ö÷±àÕõÐ©Áã»¨£¬ËûÃÇÔç¾ÍËã¼ÆºÃÁË¡£\n",
        "\n        ÌÆÉ®Èâ³ÔÁËÄÜ³¤Éú²»ÀÏÒ²ÊÇ±¨ÉÏµÄ¹ã¸æËµµÄÄØ£¡\n",
        "\nÌÆÉ®  £ºÆ­ÈËµÄÀ²£¡ÎÒÒªÓÐÕâÃ´À÷º¦µÄÈâ£¬ÎÒ×Ô¼º¾ÍÏÈ³ÔÒ»\n",
        "\n        ¿éÁË£¬»¹È¡Ê²Ã´¾­°¡£¡\n",
        "\n°×°Ö°Ö£ººß£¡ÄãÃÇ»¹²»ÊÇ½èÈ¡¾­µÄÃûÍ·¹«·ÑÂÃÓÎÂï£¡\n",
        "\nÎò¿Õ  £ºÊ²Ã´£¿ÄãÓÐÃ»ÓÐ¸ã´í°¡£¡ÎÒÃÇÒ»Â·×ßÀ´£¬È´Ò½ÉÙÒ©\n",
        "\n        ²»Ëµ£¬ÓÖÃ»ÓÐ¹Ì¶¨×¡´¦£¬ÓÖÃ»ÓÐ¹Ì¶¨µÄÊÕÈë¡£ÊµÔÚ\n",
        "\n        ²»ÐÐÎÒÃÇ°Ú¹ýµØÌ¯£¬Ë£¹ýÂíÏ·£¬Âô¹ý³ª£¬Âô¹ýÒÕ£¬\n",
        "\n        Ê²Ã´Ã»ÓÐ¸É¹ý£¡ÄãÈ¥³ÔÊº°ÉÄã£¡\n",
        "\n°×°Ö°Ö£ºÅ¶£¿Éú»îÂù¶à×Ë¶à²ÊµÄÂï£¡\n",
        "\nÉ³É®  £º²»ÈçÄãÒ²À´ÊÔÊÔ°¡£¿\n",
        "\n°×°Ö°Ö£ººÃ°¡£¡·´Õý¼ÒÀïÒ²ËÀ¹â¹âÁË£¬²»ÈçÎÒÃÇÒ»Æð×ß°É£¿\n",
        "\nÎò¿Õ  £º¶ÔÑ½£¬¶à¸öÅóÓÑ¶àÌõÂ·£¬Ò»Æð×ß°É£¡\n",
        "\nÌÆÉ®  £ºÄÇÒ»Â·ÉÏÆñ²»ÓÖ¶àÁËÒ»¸öÈËµÄ¿ªÏú£¿\n",
        "\n°×°Ö°Ö£º²»Òª½ô£¬ÎÒ»áÉÕ»ð×ö·¹£¬¿´º¢×ÓÏ´Íë£¬ÊÕÊ°ÎÝ×Ó£¬\n",
        "\n        Ï´ÒÂ·þ£¬Ë¢ÂíÍ°£¬µ¹ÌµÓÛ£¬ÄÜÈËËù²»ÄÜ£¬²»»á¸øÄã\n",
        "\n        ÃÇÌíÂé·³µÄ¡£\n",
        "\nÉ³É®  £ººÃ°¡£¡´Ó½ñºó£¬Äã¾ÍÊÇÊ¦¸µ×îÐ¡µÄÍ½µÜÁË£¬ÕâÌôµ£\n",
        " \n       ×ÓµÄÊÂ¾ÍÊÇÄãµÄÁË¡£\n",
       "\n°×°Ö°Ö£ºÔ¸ÒâÐ§ÀÍ£¡\n",
        "\n\n[1;35m£¨ÒôÀÖÉùÆð£ºÄãÌô×Åµ££¬ÎÒÇ£×ÅÂí£¬Ó­À´ÈÕ³öËÍ×ßÍíÏ¼¡­¡­£©[m\n",
});

        if (release==0) {
                this_object()->set_temp("play",0);
                return 0;
        }
  
      if (release==-1) {
                continue_play(sizeof(str1));
                return 1;
        }
seteuid(ROOT_UID);
message("channel:xjmy",HIR+"¡¼"HIG"Ä§»ÃµçÌ¨"HIR"¡½£º"+NOR+YEL+str1[sizeof(str1)-release]+NOR,users());
 this_player()->command_function(" chat "+HIC+str1[sizeof(str1)-release]+NOR);
    call_out("continue_play",3,release-1);
        return 1;
}

