#include <ansi.h>

inherit ITEM;
void create()
 {
    set_name("¼ÒÍ¥Ó°Ôº", ({"vcd"}) );
    set_weight(1000);
    if( clonep() )
           set_default_object(__FILE__);
    else {
        set("unit", "Ì¨");
        set("long", "Ò»Ì¨¸ß¼¶¼ÒÍ¥Ó°Ôº,ÉÏÃæÓÐplay,shut,kala,stopÒ»Ð©×ÖÑù.\n");
         set("no_get",1);
         set("value",10000);
    }
    setup();
}

void init()
{
       add_action("do_play", "play");
}


int do_play()
{
                if (this_object()->query_temp("play")==1) return notify_fail("ÏÖÔÚÕýÔÚ·Å×Å£Ö£Ã£ÄÄØ¡£\n");
                if (this_object()->query_temp("kala")!=0) return notify_fail("ÏÖÔÚÕýÓÐÈË³ª¿¨À²£Ï£ËÄØ¡£\n");
                this_object()->set_temp("play",1);
                call_out("start_play",2);
                return 1;
}

int start_play()
{
message("channel:chat",HIR+"¡¼"HIG"Ä§»ÃµçÌ¨"HIR"¡½£º"NOR+HIY"Ò»¸ö¹Å¹ÖµÄºÐ×ÓÔÚ×÷¹ÖÁË¡£\n"+NOR,users());
        call_out("continue_play",1,-1); 
        return 1;       
}

int continue_play(int release)
{

string *str1=({
"\n\n                 [1;33m  ´ó»°Î÷ÓÎÖ®Å®¶ù¹ú [m               \n",
    "Ê¦Í½ËÄÈËÖÕÓÚÀ´µ½Å®¶ù¹úµÄÍõ¹¬¡£\n",
    "ÌÆÉ®  £ºKAO£¡ÅÅ³¡Õæ´ó£¬ÄãÃÇ¿´ÕâÀïµÄ×°äêÉè¼ÆÒ»¶¨ÓÃÁË3DMAX¼ÓPHOTOSHOP£¬\n",
    "        ¼òÖ±ÊÇCOOL±ÐÁË£¡\n",
    "Öí°Ë½ä£ºÊÇ°¡£¬ÕâÀïÕæÊÇÌ«°ôÁË£¬±È°³¸ßÀÏ×¯»¹ÒªºÀ»ª£¡\n",
    "ËïÎò¿Õ£ºËµÄãÊÇÖ»ÖíÄã»¹ÕæÊÇÖ»Öí£¬ÈË¼ÒÕâÊÇ»Ê¹¬£¬ÄãÃÇ¸ßÀÏ×¯´ò\n",
    "        ÊµÁËËã×î¶àÒ²¾ÍÄÜËã¸ö¸»Å©£¬Äã»¹ÒÔÎªÄãÊÇÀîÊÀÃñËûÃÇ¼Ò\n",
    "        Ç×ÆÝ°¡£¿Í¸¶¹£¡\n",
    "É³É®  £º´óÊ¦ÐÖ£¬±ð¸úËûÒ»°ã¼ûÊ¶£¬ÇÆËû³¤µÃÄÇÑù£¬ÖíÍ·ÖíÄÔÄÄÄÄ\n",
    "         ¸úÄúºïÒ»ÑùµÄ¾«Ã÷ÄØ£¿\n",
    "ËïÎò¿Õ£ºÄÇÊÇ£¡\n",
    "           ¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£º¸÷Î»¾ÍÊÇ´Ó¶«ÍÁ´óÌÆ¶øÀ´È¥Î÷ÌìÈ¡¾­µÄ´óÊ¦Ã´£¿\n",
    "Öí°Ë½äÐ¡Éù¶ÔÌÆÉ®Ëµ£ºÎÒKAO£¡ÕâMM³¤µÃÕæÊÇ±êÖÂ¡££¨¿ÚË®µÎßÕµÄÌØÐ´£©\n",
    "ÌÆÉ®  £ºÊÇ°¡£¬Äã¿´ËýÌìÊ¹ÃæÈÝ,Ä§¹íÉí²Ä,ÒªßäßäÓÐßäßä,ÒªPPÓÐPP,\n",
    "        ¸Ã´óµÄµØ·½´ó,¸ÃÐ¡µÄµØ·½Ð¡,¸ÃÍ¹µÄµØ·½Í¹,¸Ã°¼µÄµØ·½°¼,\n",
    "        ¡£¡£¡£¡£¡£ÕæÊÇÓ£ÌÒÐ¡×ìÒ»µãµã£¬ÑîÁøÏ¸ÑüÈüÆ¤¹Ü£¬ÑàÓïÝº\n",
    "        Éù°¡¡£¡£¡£¡£¡£¡££¨±ÇÑªÒ»µÎÒ»µÎÍùÏÂÁ÷£©\n",
    "ËïÎò¿ÕÒ»{±ÇÑª£ºÎÒKAO£¡Ñóæ¤Âï£¬ÎÒ×îÌÖÑáÁË¡£¡£¡£¡£¡£¡£\n",
    "É³É®±ÇÑª³¤Á÷£ºÎÒ¾õµÃ»¹¿ÉÒÔ¡£¡£¡£¡£¡£¡£\n",
    "Öí°Ë½ä£ºÎÒKAO£¡ËýÔÚÍÚ±Ç¿×Ò®£¡Äã¿´¡£¡£¡£¡£¡£¡£ËýÉì³öÏËÏËÓñÊÖµã\n",
    "        ³öÖÐ¡£¡£¡£°¡¶Ô²»ÆðÊÇÐ¡ÊÖÖ¸£¬ÇáÇáµÄÍÚ°¡ÍÚ¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£ººÃ~~~~~Ë¬£¡\n",
    "ËïÎò¿Õ£ºÍÛ~~~~~~£¬ºÃ´óµÄÒ»Ûç£¡\n",
    "É³É®  £º°¦~~~~~~Ã»Ïëµ½£¬ËýÍÚ±Ç¿×µÄ×ËÊÆ¶¼ÕâÃ´ÃÀ£¡Yeah~~~~~ÎÒÏ²\n",
    "        »¶£¡ÎÒ¾ö¶¨ÁË£¬°®ÄãÒ»ÍòÄê£¡\n",
    "ÊÌÅ®  £ººÃ´óµ¨£¡¾¹È»¸Ò¶ÔÎÒ¹ú¾ýÎÞÀí£¡\n",
    "ËïÎò¿Õ£ºÐ¡MM²îÒÓ£¡ËùÎ½ÊÇ¡°‹„ñ»ÊçÅ®£¬¾ý×ÓºÃåÏ¡±£¬ÓÖÎ½¡°´²Ç°Ã÷ÔÂ\n",
    "        ¹â£¬ÒÉÊÇµØÉÏËª£¬¾ÙÍ·ÍûÃ÷ÔÂ£¬µÍÍ·Ë¼¹ÃÄï¡±¡£¡£¡£¡£¡£¡£ºÃ\n",
    "        Ê«ºÃÊ«¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£º°¡£¬Ã»Ïëµ½Ê¦¸¸¾¹ÓÐÈç´Ë²Å»ª£¬ÕæÈÃÐ¡Å®×Ó³Ô¾ª¡£¡£¡£¡£¡£\n",
    "        ¡£²»Â÷ÖÚÎ»£¬ÆäÊµÐ¡Å®×ÓÔÚÅ®¶ù¹ú¶þÊ®ÈýÄêÁË£¬¶þ~~~Ê®~~~Èý\n",
    "        ~~~ÄêÁË£¡¶Ô²»ÆðÊ§Ì¬ÁË¡£¡£¡£¡£¡£¡£ÎÒÒ»Ö±¶¼ÏëÕÒÒ»¸öÈçÒâ\n",
    "        ÀÇ¾ý£¬¿ÉÊÇÕâÀïÈ«¶¼ÊÇÅ®ÈË£¬À´ÁËÒ»¸öÕÅ¹úÈÙÃ»Ïëµ½»¹ÊÇ¸ö²£\n",
    "         Á§£¡¡£¡£¡£¡£¡£¡£ËùÒÔ£¬ÎÒÏë´Ó¸÷Î»Ö®ÖÐÑ¡³öÒ»Î»¡£¡£¡£¡£¡£¡£\n\n",
    "                   \n»°Òô¸ÕÂä¡£\n",
    "Öí°Ë½äÍ»È»Éì³¤ÊÖ±Û¸ßº°£ºÎÒ~~~~~~~ÎÒ~~~~~~~~£¡\n",
    "ËïÎò¿ÕÒ»È­´ò·­ÁËÖí°Ë½ä£ºÄãËûÂè¹öÒ»±ß£¬¿Ä¹Ï×Ó¿Ä³ö¸ö³ô³æÀ´£¬ÄãËû\n",
    "       ÂèËãÀÏ¼¸£¿\n",
    "É³É® £ºÊÇ°¡£¬ÄãÐ¡×ÓÔÚ¸ßÀÏ×¯²»ÊÇ»¹ÓÐ¸ö¸ßÐãÓ¢Ã´£¬ÔÙËµÔÂÁÁÉÏ²»ÊÇ»¹\n",
    "       ÓÐ¸öæÏ¶ðÃ´£¿\n",
    "Öí°Ë½ä£¨Î¯ÇüµÄ£©£º¸ÐÇéÆÆÁÑÁË£¡\n",
    "ÌÆÉ®Ì¾ÁË¿ÚÆø£º°¦¡£¡£¡£¡£¡£¡£Í½µÜÃÇÄÄ£¬ÄãÃÇÒ²Ì«²»ÕùÆøÁË£¬ÏóÄãÃÇÕâ\n",
    "       ÑùµÄÄÐ×Óºº£¬ËäËµ³¤µÃËðµã£¬µ«ÊÇÄãÃÇÖÁÉÙ»¹ÊÇÓÐÒ»Ð©±¾ÁìµÄÂï£¬\n",
    "       ÕæÊÇµÄ£¡¡£¡£¡£¡£¡£¡£´ó~~~~ÕÉ·òºÎ»¼ÎÞÆÞ£¬ÌìÑÄºÎ´¦ÎÞ·¼²Ý¡£¡£\n",
    "       ¡£¡£¡£¡£¿ÉÊÇ£¬ÄãÃÇµÄÊ¦¸¸~~~~~~ÎÒ¡£¡£¡£¡£¡£¡£Õâ´Î£¬ÄãÃÇÕâ´Î\n",      
    "       ³ÉÈ«³ÉÈ«ÎÒ¡£¡£¡£¡£¡£¡£\n",
    "\n\n       £¨Ê¦Í½ËÄÈËÕùÖ´²»ÐÝ£©¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£º¸÷Î»¸÷Î»£¬ÄãÃÇÒ²±ðÕùÁË£¬²»ÈçÕâÑù°É£¬´ó¼Ò²»Èç¸÷Õ¹±¾Áì£¬ÎÒ\n",
    "       ½ñÌìÒªÀ´¸ö±ÈÎäÕÐÇ×£¡\n",
    "Ê¦Í½ËÄÈË£ºÐÐ£¡\n\n",
    "    \n¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£ºÎªÁËÕâ´Î±ÈÊÔµÄ¹«ÕýÐÔ£¬ÎÒÃÇ½ñÌìÌØÒâÇëÀ´ÁËÒ»Î»¼Î±öÀ´µ±×÷²Ã\n",
    "          ÅÐ£¬Ëû¾ÍÊÇ~~~~~~~½­ºþÉÏÈË³Æ¡°ÈË¼ûÈË°®£¬ÃÔËÀÈË²»ÅâÃü³Ô²»ÁË\n",
    "          ¶µ×Å×ß¡±µÄÕÅ¹úÈÙ£¡\n",
    "ÕÅ¹úÈÙ£ººÜ¸ÐÐ»´ó¼Ò¶ÔÎÒÖ§³Ö£¬ÔÚÕâÀïÎÒÊ×ÏÈÒªÐ»Ð»¹úÍõ±ÝÏÂ£¬»¹ÒªÐ»Ð»ÎÒ\n",
    "        µÄ¼ÒÈË£¬ÒÔ¼°ÔÚ³¡µÄ¸÷Î»£¬È»ºóÎÒ»¹ÒªÐ»Ð»Ò»Ö±ÔÚÎÒ±³ºóÖ§³ÖÎÒµÄ\n",
    "        ÌÆÏÈÉú¡£¡£¡£¡£¡£¡£Honey!I love you,yeah,yeah,yeah!\n",
    "ÖÚÈË  £ºµ¹~~~~~~~~~~~~~~~~\n",
    "ËïÎò¿Õ£ºÄãÓÐÃ»ÓÐ¸ã~~~~~´í£¡ÄãÊÇÀ´µ±²ÃÅÐµÄ£¬ÄãÒÔÎªÊÇÔÚºì¿°ÌåÓý¹Ý°¡£¿\n",
    "ÕÅ¹úÈÙ£ºSorry,Sorry!ÎÒÖ®ËùÒÔÒª½²ÕâÃ´¶à£¬ÍêÈ«ÊÇÒòÎª¡£¡£¡£¡£¡£¡£ÆäÊµ\n",
    "        ÎÒÊÇÒ»¸öÑÝÔ±¡£¡£¡£¡£¡£¡£\n",
    "£¨ÎÞÊýÖ»Î÷ºìÊÁ¡¢³ô¼¦µ°ÖÀÁË¹ýÈ¥£©\n",
    "¡£¡£¡£¡£¡£¡£\n",
    "ÕÅ¹úÈÙ£ººÃÁË£¬ÏÂÃæ¹«²¼±ÈÈüµÄÏîÄ¿¡£\n",
    "ÖÚÈËÄýÉñ¾²Ìý¡£\n",
    "ÕÅ¹úÈÙ£ºÎªÁË±ÈÈüµÄ¹ÛÉÍÐÔ¡¢ÓéÀÖÐÔÒÔ¼°±¾×Å¹«Æ½¾ºÈüµÄÔ­Ôò£¬±ÈÈü·ÖÁ½¸ö\n",
    "        ½×¶Î¡£ÓÉÓÚ¸úµçÊÓÌ¨µÄ´èÉÌÎÊÌâ£¬ÎÒÃÇÖ±½Ó²ÉÓÃÌÔÌ­ÈüÖÆ¡£ºÃµÄ£¬\n",
    "        ±ÈÈüµÄÌâÄ¿ÊÇ~~~~~~~°ç¿á£¡\n",
    "»°Òô¸ÕÂä£¬´óÌüÄÚÍ»È»³öÏÖÒ»ÕóÑÌÎí¡£\n",
    "Å®¶ù¹úÍõ£ºÍÛ~~~~~~Î´À´Õ½Ê¿£¡\n",
    "Öí°Ë½ä£º²»´í£¡ÆäÊµ£¬ÎÒ¾ÍÊÇÎ´À´Õ½Ê¿£¬°¢Åµ¡£Öí~~~~~»ª£¡¿á°É£¿ß×¡£¡£¡£\n",
    "        Ë­ÔÚÍ±ÎÒÆ¨¹É£¿\n",
    "ËïÎò¿ÕÒ»ß¦ÕÈ´òÔÚÖí°Ë½äÍ·ÉÏ£º¿áÄãÂè¸öÍ·À²£¬ÇÆÄãÄÇ¸±µÂÐÔ£ºÒ»Ö§Ñ©ÇÑ²åÔÚ\n",
    "        ±Ç×ÓÀï×ìÀïÒ§×Å¸±Ä«¾µÁ½ÍÈÖ®¼ä»¹¼Ð×ÅÒ»°ÑAK47¡£¡£¡£¡£¡£¡£\n",
    "Öí°Ë½ä¿ÞµÀ£º´óÊ¦ÐÖ£¬²»ÊÇÄã½ÌÎÒË£¿áÒªÓÐÑ©ÇÑ¡¢Ä«¾µ»¹ÓÐÇ¹Ã´£¿\n",
    "ËïÎò¿Õ£ºKAO£¡ÎÒÓÐ½ÌÄãÕâÃ´´îÅäÃ´£¿\n",
    "Öí°Ë½äÆËµ½ËïÎò¿Õ»³Àï£¬¸§Ãþ×ÅËïÎò¿ÕµÄÐØ¸¬£¬º¿ßû´ó¿Þ£ºÊ¦ÐÖ£¬ÎÒ´íÁË\n",
    "        ¡£¡£¡£¡£¡£¡£ÎÒ²»¸Ã°Ñ°ÑÑ©ÇÑ²åÔÚ±Ç×ÓÀï£¬²»¸Ã²åÔÚ±Ç×ÓÀï¡£¡£¡£\n",     
    "        ¡£¡£¡£55555\n",
    "ËïÎò¿ÕÇáÇáÅÄÅÄÖí°Ë½äµÄÍ·£¬Ò»°ÑÑÛÀá£ººÃÁËÀ²£¬±ðÕâÑùÁË£¬ÒÔºó±ðÕâÑù¾Í\n",
    "        ºÃÁËÀ²£¬À´£¬²Á°ÑÑÛÀá£¬ÈÃ´ó»ï¿´¼û¶à²»ºÃÒâË¼°¡£¿\n",
    "Öí°Ë½ä£ºÅ¶¡£¡£¡£¡£¡£¡£ÓÐ¹»Ë¥µÄ£¬ÕâÏÂÃ»¸ãÍ·ÁË£¬ÎÒÍË³ö¡£\n",
    "ÕÅ¹úÈÙ£ººÃµÄµÚÒ»¸ö²ÎÈüÕßÍË³ö£¬NOW£¬The next one!\n", 
    "É³É®  £º¿´ÎÒµÄ£¡\n",
    "Ò»ÕóÑÌÎí¹ýºó¡£\n",
    "ÖÚÈË£ºÍÛ~~~~~~ÌÆ²®»¢Ò®£¡\n",
    "É³É®ÊÖÄÃÒ»°ÑÕÛÉÈ³ª£ºÇóÉñÄÇ¸öÇóÉñ£¬³ÏÐÄÆíÇóÄÇ¸öÁéÉñ£¨ÓÃÔÁÓï£©¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£ºSTOP£¡°çÊ²Ã´²»ºÃÄãÆ«Òª°çÌÆ²®»¢£¿ÄãÒ»´ó°Ñºú×ÓÌêµÃ¹â¹âµÄ£¬\n",
    "          ²»Ïëµ±ºÍÉÐÄÄµÀÄãÏë×´ÔªÄÄ£¿\n",
    "É³É® £ºÎÒÓÐÏë¹ý°¡¡£¡£¡£¡£¡£¡£\n",
    "Å®¶ù¹úÍõ£ºÏëÄãÂè¸öÍ·À²£¬ÄãºÃºÃµÄÒ»¸öºÍÉÐ²»×ö»¹Ïëµ±×´Ôª£¬ÎÒ¸úÄãËµ£¬\n",
    "ºÃºÃ×öÄãºÍÉÐÕâ·ÝºÜÓÐÇ°Í¾µÄÖ°Òµ°É£¡\n",
    "É³É® £ºÅ¶ÖªµÀÁË¡£¡£¡£¡£¡£¡£\n",
    "ÕÅ¹úÈÙ£ºÄÇÃ´É³É®Ò²³ö¾ÖÁË¡£ÏÂÃæ»áÊÇË­ÄØ£¿Çë~~~~~~~¿´£¬ÏÂÃæ³ö³¡µÄ\n",
    "        ÊÇ~~~~~~~\n",
    "´ó°×ÅÖ×Ó£º×Ô´ÓÎÒÓÃÁËÕâÑÀ¸à£¬ºÙ£¬ÑÀºÃÎ¸¿Ú¾ÍºÃ£¬³ÔÂïÂïÏã£¬ÄúÎÊÕâÊ²\n",
    "        Ã´ÅÆ×Ó£¿Äú³ò×¼ÁË£¬À¶ÌìÁù²»ÖÎ¡£¡£¡£¡£¡£¡£\n",
    "¸èÉù £º»ØÍ·±ãÖª£¬ÎÒÐÄÖ»ÓÐÄã¡£¡£¡£¡£¡£¡£\n",
    "ÁõµÂ»ª£ºÎÒÎªÊ²Ã´»áÓÐÕâÃ´¶¯ÈËµÄ¸èÉù£¿ÕâÈ«ÊÇÒòÎªÎÒ¾­³£³Ô¡°WC¡±ÅÆÀæ\n",
    "        ¸àÌÇ¡£¡°WC¡±ÅÆÀæ¸àÌÇÊÇÄúÔÚ¼ÒÐÝÏÐ£¬Íâ³öÂÃÓÎ£¬·ÃÇ×ËÍÓÑÖ®±Ø\n",
    "        ±¸¼ÑÆ·¡£¡£¡£¡£¡£¡£\n",
    "ÕÅ¹úÈÙ£º¸÷Î»£¬¶Ô²»Æð£¬¸Õ¸ÕÊÇ¹ã¸æÊ±¼ä¡£ÏÂÃæÎÒÃÇ½Ó×Å½øÈë±ÈÈü¡£¡£¡£¡£\n",
    "        ¡£¡£ÏÖÔÚÖ»Ê£ÏÂÁ½Î»²ÎÈüÕßÁË£¬µ½µ×Ë­ÄÜµÃµ½ÎÒÃÇ¹úÍõ±ÝÏÂµÄÃÀÈË\n",
    "        ¹éÄØ£¬ÊÇÌÆÉ®»¹ÊÇËïÎò¿Õ£¿´ó¼ÒÊÃÄ¿ÒÔ´ý¡£\n",
    "ÌÆÉ®Ë«ÊÖºÏÊ²£ºÆ¶É®²¢²»»á°ç¿á£¬Ö»ÊÇÔÚÏÂÏëÈÃ´ó¼Ò¿´¿´ÎÒµÄÕæÃæÄ¿¡£\n",
    "   »°Òô¸ÕÂä£¬ÌÆÉ®¿í´óµÄôÂôÄÍ»È»ÁÑ³ÉËéÆ¬£¬Â¶³öÌúËþ°ã½áÊµµÄ¼¡Èâ¡£\n",
    "ÌÆÉ®ÄüÐ¦£ºÆäÊµÎÒ¾ÍÊÇ½­ºþÉÏÈË³Æ¡°´ò²»ËÀµÄÐ¡ÉñÍ¯½ð¸Õ²»»µµÄÄ§¹í¼¡\n",
    "          ÈâÈË¡±£¡ÄãÃÇ¿´£¬ÎÒ×óÇàÁú£¬ÓÒ±ß»¹ÊÇÇàÁú£¬ÎÒÉÏÉÏÏÂÏÂ×ó\n",
    "          ×óÓÒÓÒÈ«ÊÇÇàÁú¡£ÔõÃ´Ñù£¬¿Ö²À°É¡£¡£¡£¡£¡£¡£\n",
    "           ÖÚÈË½Ô·­µ¹¡£\n\n",
    "ÕÅ¹úÈÙÆË½øÌÆÉ®µÄ»³Àï£¬¸§Ãþ×ÅÌÆÉ®½áÊµµÄ¼¡Èâ£ºÍÛ~~~~~~~ºÃÐÔ~~~~~~¸Ð\n",
    "          ÄÄ£¡ÎÒÏ²»¶£¡\n",
    "´óÌüÀïÍÂ³ÉÒ»Æ¬¡£\n",
    "ËïÎò¿Õ£ºÃ»Ïëµ½£¬Ê¦¸¸Äã¾ÓÈ»¾ÍÊÇ¡°Ä§¹í¼¡ÈâÈË¡±£¡×÷ÎªÄãµÄÍ½µÜ¡£¡£¡£\n",
    "        ÎÒÊµÔÚÊÇÅå·þ¡£\n",
    "ÌÆÉ®  £ºÔõÃ´Ñù£¬ÅÂÁË°É£¡\n",
    "ËïÎò¿Õ£ºÍ½µÜ¸Ê°ÝÏÂ·ç£¡\n",
    "ÌÆÉ®  £ºÄÇÃ´¡£¡£¡£¡£¡£¡£\n",
    "ËïÎò¿Õ£º²»ÓÃ±ÈÁË£¬µÜ×ÓÍË³ö¡£\n",
    "Å®¶ù¹úÍõ£ºÕâ³¡±ÈÊÔÏ¹×ÓÒ²ÄÜ¿´³öÀ´ÊÇË­Ê¤³öÁË£¬ÄÇÃ´ÎÒµÄÈçÒâÀÇ¾ý±ãÊÇ\n",
    "          ¡£¡£¡£¡£¡£¡£\n",
    "ÌÆÉ®    £ºÂý×Å£¬ÎÒÒ²ÍË³ö£¡\n",
    "Å®¶ù¹úÍõ£º¸øÎÒ¸öÀíÓÉÏÈ£¡°ÝÍÐ~~~~~£¡\n",
    "ÌÆÉ®    £ºÐèÒªÂð£¿\n",
    "Å®¶ù¹úÍõ£º²»ÐèÒªÂð£¿\n",
    "ÌÆÉ®    £ºÐèÒªÂð£¿\n",
    "Å®¶ù¹úÍõ£º²»ÐèÒªÂð£¿\n",
    "ÌÆÉ®    £º°¦¡£¡£¡£¡£¡£¡£ÎÒÖ»ÊÇ¸úÄãËæ±ãÁÄÁÄ£¬Ç§Íò²»Òªµ±Õæ¡£¡£¡£¡£¡£¡£\n",
    "          ÐèÒªÂð£¿\n",
    "Å®¶ù¹úÍõ£ºÒ»¶¨Òª£¡\n",
    "ÌÆÉ®    £º¼ÈÈ»±ÝÏÂÒ»¶¨Òª¡£ÄÇÃ´ÎÒ¾Í¸æËßÄãÊµÇé¡£ÆäÊµÎÒ²¢²»Ïëµ±ÄãµÄÈçÒâ\n",
    "          ÀÉ¾ý£¬ÎÒÖ»ÊÇÏëÖ¤Ã÷¸ø´ó¼Ò¿´£¬ÎÒÀÏÌÆ²ÅÊÇÕâËÄ¸öÈËÖÐµÄÀÏ´ó£¡Ëû\n",
    "          ÃÇÈý¶¼µÃÌýÎÒµÄ£¬ÎÞÂÛ±ÈÊ²Ã´ÎÒ¶¼ÒªÇ¿¹ýÕâ¸çÈý£¡\n", 
    "Å®¶ù¹úÍõ£ºÄã¡£¡£¡£¡£¡£¡£\n",
    "ÌÆÉ®    £ºÄãÊ²Ã´Äã£¬ÄãÔÙ¸Òß´ß´ÍáÍáµ±ÐÄÎÒ±âÄã£¡Í½µÜÃÇ£¬×ß£¡\n",
    "£¨¸èÉùÏìÆð¡°ÄãÌô×Åµ££¬Äã»¹Ç£×ÅÂí±³×Å¸öÖí°Ë¡£¡£¡£¡£¡£¡£¡±£©\n",
    "Èô¸ÉÄêºó£¬Å®¶ù¹úÍõ£ºÔø¾­ÓÐÒ»·ÝÕæ³ÏµÄ°®Çé°ÚÔÚËûµÄÃæÇ°£¬µ«ÊÇËûÃ»ÓÐ\n",
    "ÕäÏ§£¬µÈµ½ÁËÊ§È¥µÄÊ±ºò²Åºó»ÚÄª¼°£¬³¾ÊÀ¼ä×îÍ´¿àµÄÊÂÄª¹ýÓÚ´Ë¡£Èç¹û\n",
    "ÉÏÌì¿ÉÒÔ¸øËûÒ»¸ö»ú»áÔÙÀ´Ò»´ÎµÄ»°£¬ÎÒÏëËû»¹ÊÇ²»»á´ðÓ¦ÎÒ¡£Èç¹û·ÇÒª\n",
    "°ÑÕâ·Ý¾øÇé¼ÓÉÏÒ»¸öÆÚÏÞ£¬ÎÒÏë»áÊÇÒ»ÍòÄê£¡\n",
});

        if (release==0) {
                this_object()->set_temp("play",0);
                return 0;
        }
  
      if (release==-1) {
                continue_play(sizeof(str1));
                return 1;
        }
message("channel:xjmy",HIR+"¡¼"HIG"Ä§»ÃµçÌ¨"HIR"¡½£º"+NOR+YEL+str1[sizeof(str1)-release]+NOR,users());
      call_out("continue_play",3,release-1);
        return 1;
}

