// иЯ╩╟йю╫Г║╓нВсн╪г║╓╟Ф╠╬ё╢ё╝ё╣ё╟
/* <SecCrypt CPL V3R05> */
 
#include <room.h>
inherit ROOM;

void create ()
{
  set ("short", "[37m╟всЯге[m");
  set ("long", @LONG

р╩вЫсцио╨ц╣д╣АЁь╟всЯкЫтЛ╣дп║ге,геиМхГ╨Г,иоцФ╩╧©лвер╩п╘
╡╩ж╙╣юцХйЖй╡ц╢╣дм╪╩╜.ге╣да╫етйгр╩лУгЕЁ╨╣дп║╨с,╨сиопгпг╣Ц╣Ц
╣ьиЗвер╩п╘╡йа╚,╪╦╤тт╖яЛтз╨сжпсфоп╣дснве,е╪╤Шр╡дэ©╢╪Шр╩а╫ж╩
ои╨в╢сгеио╥и╧Щ,ге╣д╠╠цФ╬мйгаИоЖ╠╕╣Нак.
LONG);

  set("exits", ([ /* sizeof() == 1 */
    "south" : __DIR__"nanmenting.c",
      "north" : __DIR__"dianmen.c",
]));


  set("objects", ([ /* sizeof() == 1 */
  __DIR__"npc/tong-nan" : 2,
]));

  setup();
}
