// Éñ»°ÊÀ½ç¡¤Î÷ÓÎ¼Ç¡¤°æ±¾£´£®£µ£°
/* <SecCrypt CPL V3R05> */
 
#include <room.h>
inherit ROOM;


int valid_leave();

void create ()
{
  set ("short", "[0;35mÈıÌ«×Ó¸®[m");
  set ("long", @LONG

¸®ÖĞµÄÖ÷ÈËÄËÊÇÈıÌ«×ÓÄÄß¸£¬Óù·âµÄÈıÌ³º£»á´ó½«¡£µ±³õÄÄß¸Äê
´³»ö£¬ÌìÍõ¿ÖÓĞºó»¼ÓûÉ±Ö®£¬ÄÄß¸·Ü¶ø¸îÈâ»¹Ä¸£¬ÌŞ¹Ç»¹¸¸£¬Ò»
µãÁé»êÆ®µ½Î÷·½¼«ÀÖÊÀ½ç£¬·ğÒÔ±ÌÅºÎª¹Ç£¬ºÉÒ¶ÎªÒÂ£¬Äî¶¯ÆğËÀ
»ØÉúÕæÑÔ£¬ÄÄß¸ËìÓÖµÃÁËĞÔÃü¡£ºó½µ·ş¾ÅÊ®Áù¶´ÑıÄ§£¬¶ËµØÊÇÉñ
Í¨¹ã´ó¡£
LONG);

  set("exits", ([ /* sizeof() == 1 */
    "north" : __DIR__"yongdao",
  ]));
    set("objects", ([ /* sizeof()== 3 */
__DIR__"npc/nezha" : 1,
]));
set("outdoors", 1);
  setup();
}


