
mapping obstacles = ([
  "river"             : "  1. 第一关：   阿克伦",
  "yi"             : "  2. 第二关:    第一狱",
  "er"             : "  3. 第三关:    第二狱",
  "san"             : "  4. 第四关:    第三狱",
  "si"             : "  5. 第五关:    第四狱",
  "wu"             : "  6. 第六关:    第五狱",
  "liu2"             : "  7. 第七关:    第六狱",
  "qi"             : "  8. 第八关:    第七狱",
  "ba1"             : "  9. 第九关:    第八狱",
  "tu1"            : " 10. 第十关:    一之图",
  "tu2"            : " 11. 第十一关:  二之图",
  "tu3"            : " 12. 第十二关:  三之图",
  "tu4"            : " 13. 第十三关:  四之图",
  "tu5"            : " 14. 第十四关:  五之图",
  "jingtu"            : " 15. 第十五关:  极乐净土",
]);

