// LLY@FYSY
#include <room.h>
inherit ROOM;
void create()
{
        set("short", "´óÌü");
        set("long", @LONG
Ò»½ø´óÌü£¬±ã¿É¿´µ½´óÌüµÄÁ½¸ù¶¥ÖùÉÏ¹Ò×ÅÁ½¿é³¤Ä¾¶ÔÁª£¬ÉÏÊé£º
[37m
		   ½£	     Ò»
		   Æø	     ½£
		   ×İ	     ¹â
		   ºá	     º®
		   Èı	     Ê®
		   Íò	     ¾Å
		   Àï	     ÖŞ
[0m
¶ÔÁªµÄÖĞ¼äÆ«ºóµÄµØ·½±ãÊÇÖ÷ÈËµÄ×ùÎ»£¬´óÌüÁ½±ßÅÅÁĞ×Å¼¸Ê®¸öÂŞººÒÎ£¬
ÊÇÀ´·Ã±ö¿ÍµÄ×ùÎ»£¬´óÌüÖĞºìÌºÆÌµØ£¬ËÄ´¦½ÔÊÇ¹ÅÍæ£¬Ãû»­£¬»¨ÏãËÄÒç£¬
Ö»ÊÇÓëÖÚ²»Í¬µÄµØ·½±ãÊÇºáÁºÉÏËÆºõÉÙÁËÒ»¿éØÒËÆµÄ¡£
LONG
        );
                set("exits", ([ /* sizeof() == 4 */
  "north" : __DIR__"ty",
  "south" : __DIR__"qhuayuan",
  "east" : __DIR__"rpt",
  "west" : __DIR__"lpt",
]));
  set("outdoors", __DIR__);
              set("coor/x",-1310);

	set("coor/y",260);

	set("coor/z",10);
	setup();
}
