inherit ROOM;

void create()
{
	set("short", "±ÈÎä´ó»áÕıÃÅ");
	set("long", @LONG
ÕâÊÇ±ÈÎä´ó»áµÄÕıÃÅ¿Ú,¸÷Â·ÎäÁÖÈËÊ¿ÔÆ¼¯´Ë´¦£¬´ó¼Ò¸ö¸öÄ¦È­
²ÁÕÆ£¬Ô¾Ô¾ÓûÊÔ¡£Á½Ãû½õÒÂÎÀÒ»×óÒ»ÓÒµÄÕ¾ÔÚ´óÃÅ¿Ú£¬Î¬³Ö×Å±ÈÎä´ó
»áµÄÖÈĞò¡£¹«Æ½×ÓÒ²ÔÚÕâ¸ºÔğ´ó»áµÄÕı³£½øĞĞ¡£Î¡¶ëµÄ´óÃÅÉÏ¸ßĞü×Å
³¯Í¢»ÊµÛ[0;5;37mÁ[5mÖ[5mÑ[5m©[0mÓù´ÍµÄ½ğØÒ¡£ÅÔ±ßÓĞ¿éÅÆ×Ó£¨£ó£é£ç£î£©£¬ÄãÕæµÄºÜÏë
¶ÁÒ»ÏÂËü£¨£ì£ï£ï£ë¡¡£ó£é£ç£î£©¡£

[35m                      ÒÔ  Îä  »á  ÓÑ[0m

[35m                      µã  µ½  Îª  Ö¹[0m

LONG
	);
	set("item_desc", ([ /* sizeof() == 1 */
  "sign" : "ÕıÔÚĞ´
ÕıÔÚĞ´
ÕıÔÚĞ´
ÕıÔÚĞ´
",
]));
	set("objects", ([ /* sizeof() == 1 */
  __DIR__"npc/guard2" : 2,
]));
	set("no_magic", 1);
	set("no_beg", 1);
	set("exits", ([ /* sizeof() == 1 */
  "enter" : __DIR__"guodao",
]));
	set("no_fight", 1);
	set("no_clean_up", 0);
        setup();
}

void init()
{
   add_action("do_quit", "quit");
}
int do_quit()
{
  write("ÄãÔÚ±ÈÎä´ó»áÆÚ¼ä²»ÄÜÍË³ö£®£®£®£®£¡\n");
  return 1;
}

