// /d/guzhanchang/pomiao.c
inherit ROOM;
int do_out();
void create()
{
        set("short", "冲冥殿");
         set ("long", @LONG
 "
        !
                  /^\
                /     \
 |           | (       ) |           |
/^\ |       /^\ \     / /^\       | /^\
|O|/^\     (   )|-----|(   )     /^\|O|
|_||-| |^-^|---||-----||---|^-^| |-||_|
|O||O| |/^\|/^\||  |  ||/^\|/^\| |O||O|
|-||-| ||_|||_||| /^\ |||_|||_|| |-||-|
|O||O| |/^\|/^\||(   )||/^\|/^\| |O||O|
|-||-| ||_|||_||||   ||||_|||_|| |-||-|
     苦越甘睐千升修  重道扶教衣锑耕
这里就是九重天的尽头了。
LONG);
                     
set("exits", ([
                
        ]));
  set("objects", ([
             __DIR__"npc/shizhe" : 1,
        ]));
        set("no_clean_up", 0);
        setup();
}

