//¡¾ÊñÉ½ÅÉ¡¿mhxy-yushu 2001/2
inherit ROOM;
#include <room.h>
#include <ansi.h>
void create ()
{
  set ("short","É½ÃÅ");
  set ("long", @LONG
ÕâÀïÊÇÊñÉ½½£ÅÉµÄÉ½ÃÅ£¬Õû¸öÉ½ÃÅÇ°ÓÉ´ó¿éµÄÇàÊ¯ÆÌ³É£¬¼«Îª
Æ½Ì¹¡£µ«ÒòÄê´ú¾ÃÔ¶£¬¶¼ÓĞĞ©ÆÆËğ¡£´Ô´ÔĞ¡²İ´ÓÊ¯°åµÄ·ìÏ¶ÖĞ³¤
ÁË³öÀ´¡£¹ã³¡ÖÜÎ§¶¼ÊÇÃÜÃÜµÄËÉÊ÷ÁÖ£¬ËÄ½ÇÉÏ¸÷·ÅÁË¼¸¿éÊ¯±®£¬
×Ö¼£¶¼ÉõÎªÄ£ºı¡£ÕıÇ°·½»ÆÇ½±ÌÍß£¬·ÉéÜÇÌéİ£¬ÕıÖĞÒ»µÀ¶şÕÉÀ´
¿í£¬ÈıÕÉÀ´¸ßµÄÖìºìÉ¼Ä¾°üÍ­´óÃÅ(door)¡£ÉÏ·½Ò»¿é´óØÒ£¬Áú·É
·ïÎèµØÊé×Å¡º[1;36m Êñ É½ ½£ ÅÉ [2;37;0m¡»ËÄ¸ö´ó×Ö¡£
LONG);

  set("outdoors", 2);
  set("exits", ([   
        "enter" : __DIR__"yongdao",
  "southdown" : __DIR__"yingketing",
  ]));
create_door("enter", "´óÃÅ", "out", DOOR_CLOSED);
setup();

}

